{
  "id": "919141b395dd0d3f5deee80376fcf9a7c7076c5b",
  "source_url": "if://competitor/mambu/deep-intel/2025-12-03/part-12",
  "source_type": "competitor_intelligence",
  "retrieved_at": "2025-12-03T19:33:27.797849+00:00",
  "metadata": {
    "competitor": "mambu",
    "part": 12,
    "total_parts": 13,
    "depth": "comprehensive"
  },
  "content": "**Document 38:** Analyst Recognition Summary - Forrester Wave Q4 2024: included in Digital Banking Processing Platforms, one of top evaluated vendors. Everest Group 2024: included in Core Banking Technology Top 50. IDC MarketScape 2024: APAC Leader in Digital Core Banking Platforms, EMEA Leader in EMEA Digital Core Banking Platforms 2024, North America Major Player (NOT Leader) in North American Digital Core Banking Platforms 2024. Juniper Research June 2024: assessed 18 leading core banking vendors, Mambu revealed as Leader alongside Temenos and FIS, Finastra and Tata Consultancy Services also in top vendors. Critical analysis: Mambu is Leader in APAC and EMEA but only Major Player in North America suggesting weaker US market presence. Named alongside established players (Temenos, FIS) but with far fewer customer reviews on Gartner (18 vs 62-65). No Gartner Magic Quadrant Leader status mentioned.\n\n**Document 39:** Conference Presentations 2024 - Money20/20 USA 2024 Las Vegas: FinTech Futures interview with Anshul Verma (Mambu Senior Strategic Partnerships Manager) and Manpreet Singh (Deloitte Managing Director), discussed accelerating digital transformation with new fintech innovations, key trends (changing customer demands, new banking regulations), composable ecosystem approach to modernizing tech stack, collaboration between fintechs and FIs, Mambu-Deloitte partnership developing innovative products/services. Money20/20 Europe 2024: Mambu team at stand 1G40, 3 days fintech biggest/brightest stars. Money20/20 Asia 2024: Omar Paul (SVP Product and Engineering) and Woratep Yunyongkul (Country Manager Thailand) presented with customers Bank Aladin and MoneyDD, partners AWS and GCP, insights about technology bringing opportunities to market, trends emerging in finance for year to come. Finovate History: Mambu debut FinovateAsia 2013, FinDEVr New York 2016 presentation on Smart Consumer Lending Platform and Scoring Architecture. No specific Mambu presentations at Finovate 2024 conferences found, though Finovate continues covering Mambu news including composable banking approach for credit unions in North America.\n\n**Document 40:** LinkedIn & Employee Count - LinkedIn: 69,598 followers, company describes \"The SaaS cloud banking platform with unique composable approach\", concept of \"composable banking\" originated at Mambu, champions of composable for over decade. Employee count (varying sources): ~686 employees across 6 continents (August 2025), 697 total employees with 30 sales reps carrying quota (Getlatka), engineering team 187, marketing team 17, EQT Group investor data: 700 employees globally, top-decile employee satisfaction score, 501-1000 employees category (LeadIQ). Employee growth trends: 0% last year (Growjo), historically 100% YoY in 2020. Company background: Series E company based Amsterdam Netherlands, founded 2011 by Eugene Danilkis, Frederik Pfisterer, Sofia Nunes, provider of cloud banking platform delivering composable banking/financial experiences, 260+ banks/lenders/fintechs/retailers in 65 countries use Mambu to build modern digital financial products, raised $446M from Bessemer Venture Partners, TCV, Runa Capital, valuation $5.5B.\n\n**Document 41:** Board & Investors - Board of Directors: 5 members including Andre Bliznyuk, 7 members/advisors including Brian Feinstein. Key board members: Stefan Tirtey (10 years, CommerzVentures founder, Fintech Investor), Henning (Deutsche Post/Munich Re board, formerly Deutsche Bank board), Carolina (EQT Growth partner supporting scale-up tech companies, former Softbank Vision Fund partner, former Atomico partner), John (TCV general partner founding member Europe investment efforts, focus on software/internet/fintech, current investments: Believe, Brex, Celonis, Dream Sports, Klarna, Mambu, Miro, Mollie, Razorpay), Brian (Bessemer Venture Partners partner, $5B under management in San Francisco). Founders: Eugene Danilkis, Frederik Pfisterer, 1 other (Sofia Nunes), 3 founders total. Investors: raised $445M, EQT, Plug and Play Tech Center, Arena Holdings, TCV, Tiger Global Management are 5 of 15 investors, $446M from Bessemer Venture Partners, TCV, Runa Capital, valuation $5.5B, latest funding $266M Series E Dec 09 2021 led by EQT with Acton Capital, Arena Holdings, Bessemer Venture Partners participation.\n\n**Document 42:** Multi-Currency Support - Multi-currency account support: \"building cross-border payment infrastructure never easier with Mambu Payments\" combined with multi-currency accounts and integrations. Customers can monitor/manage all accounts including multi-currency from central dashboard and API, retrieve balances for each supported currency of connected account from dashboard and API. Currency configuration: fiat currencies internationally-accepted usually issued by government/central bank, included in ISO 4217 currency list, can define deposit products in multiple fiat currencies and perform transactions in those currencies, must first add all relevant currencies and set respective exchange rates, Mambu plans support variety of cryptocurrencies (coins, central bank digital currencies CBDCs, tokens). Currencycloud integration for cross-border payments: Mambu partnered with Currencycloud (leader in embedded B2B cross-border solutions) to offer increased transparency and scalability of international payments to platform clients, integration already available for Mambu customers, Interbank Local payment is transfer of funds in same currency processed via Currencycloud's connections to most important national/international payment schemes (SEPA for Euro, ACH for US Dollars, FPS for Pound Sterling). Case study OKEO: Mambu's composable platform enables OKEO to offer multi-currency foreign exchange payments at rates up to 5x better than traditional institution, delivery times ranging from minutes to maximum 1 business day irrespective of currency chosen. Payment gateway capabilities: Payment Order capability purpose is orchestrate movement of money between account in Mambu and account at third-party financial institution (both domestic and international), MPG (Mambu Payment Gateway) offers access to over 27 Eurozone countries and can be extended for additional AML and suspense account flows. Multi-currency wallet solution: Persistent developed solution with pre-built integrations into Mambu and ISV ecosystem enabling institutions to launch Multi-Currency Wallet quickly, decisively, globally, easy and transparent movement of money allows users to transfer payments and funds to various currency accounts so they can send, receive, spend like a local.\n\n**Document 43:** Engineering Architecture Evolution - Engineering insights: Engineering Manager Alex Sarbusca discusses low-code approaches, Mambu hosted online events dedicated to architecture and software design including \"Codecamp_The one with Architecture & Design Powered by Mambu\". Cloud architecture on Google Cloud: Mambu chose build composable banking platform on Google Cloud for flexibility, security, data residency, availability, originally built cloud architecture on GKE and Compute Engine, now looking to serverless future for easier scaling, continuing to break up larger pieces of code into microservices to increase agility and velocity enabling consistent updates to discrete areas without affecting whole, believe elastic scalability of serverless architecture built on Cloud Run will help achieve time and cost efficiencies allowing fire up containers to meet high transactions-per-second needs and spin down when not needed. Breaking the monolith: Principal Engineers George Ghimici and Manzur Mukhitdinov presented \"Journey of breaking the monolith: a systematic approach\" at Codecamp, Alexey Lapusta (solutions architect) suggests enterprise systems should be designed as composable architectures with API-driven systems noting \"most successful holistic systems started as well-structured monoliths, partitioned into smaller segments for either operation (e.g. frequent deployments of UI) or technology aspects\". Engineering culture ShipIT hackathons: internal hackathon focuses on improving product capabilities and engineering efficiency, \"ThinkIT\" phase had Mambuvians contribute 28 inspiring ideas impacting products, team embraces devops mindset focusing on removing handovers and putting observability and proactive monitoring front and centre, Ben Goldin (CTO): \"amazing to see how much we could achieve in two and a half days by focused and undistracted working on something meaningful\". Platform overview: Thoughtworks describes Mambu as SaaS cloud banking platform empowering customers to easily and flexibly build and change banking and lending products, unlike other core banking platforms with hard-coded integration Mambu designed for constantly changing financial offerings and provides API-driven approach to customize business logic, process and integrations. Technical architecture details: Mambu's cloud application architecture processes HTTPS requests channeled from public load balancer to cluster of non-public application servers which communicate with non-public database server, load balancer/application server/database layer all kept redundant in two nearby data centers, firewalls restricting inbound access to whitelisted IP addresses and ports.\n\n**Document 44:** League Data Migration Case Study - League Data (Canada credit unions) moved from legacy core banking system to Mambu's cloud-based solution running on AWS, migrating majority of operations and developing protocol to cut over customers to new core in just 48 hours. League Data works with credit unions to help them prepare for migration, after preparation complete League Data can do actual cutover to new system in less than 48 hours with no disruption to services. Context from legacy system modernization research: full replacement is most risky and expensive option for modernizing core system, often method of last resort when legacy core stops meeting business needs, replacement process can introduce many sources of risk including downtime of core systems, data migration, reliability of new system, sufficiency of resources to support transition. Mambu is among new core providers (along with Finastra, FintechOS, Finzly) that may enable financial institutions to implement instant payments relatively quickly, as some of these companies first to provide API connection to Federal Reserve's new instant payment service FedNow.\n\n**Document 45:** Customer Service & Support Issues - Customer feedback from reviews: \"Calls for stronger customer support\", \"Faster response times\", \"More extensive assistance to address user concerns and issues effectively\", \"Mambu needs to focus more on customer orientation\", \"Provide self-guided learning materials for people to learn how to configure and use Mambu\". Business impact: customers struggle with platform adoption, steeper learning curve than expected, slower resolution of issues. Feature requests process: if you'd like to raise your own idea, Mambu recommends discussing with your Customer Success Manager who will review requirements, analyze potential gaps, research alternative solutions, help make sure Mambu has all information product team needs to effectively integrate idea into development roadmap. Customer engagement tools: Mambu leverages crowdsourcing and community engagement enabling customers and prospects to express ideas and provide suggestions asynchronously through tools like Aha! and Mambu Community, ideas/trends/new patterns from customer engagement contribute to Mambu's product strategy and roadmap both technically and functionally, work closely with existing customers providing support and services directly giving customers opportunity to contribute to roadmap and platform development. Accessing product roadmap: can access Product Roadmap providing insights into Mambu deliverables through Customer Service Portal by selecting Files > Product. Customer feedback on process: per Gartner reviews while some hiccups and shortcomings in API (expected in product this size), \"Mambu is very open about it, opens feature requests for you, is transparent about the roadmap\". API roadmap questions: stay up to date on new features with release notes published on Mambu Community site, if specific questions or requests about API roadmap contact Mambu directly, if would like to request access to Generally Available feature or capability not automatically enabled for your environment get in touch with Mambu Customer Success Manager to discuss requirements.\n\n**Document 46:** Press Releases 2024-2025 - 2025 announcements: May 27 2025 global cloud banking leader Mambu unveiled Mambu Payments expanding composable banking platform to include modern end-to-end payment capabilities, Ellie Heath (former Senior VP People) promoted to Chief People Officer March 19 2025 (joined Oct 2021), Semhal Tarekegn O'Gorman (joined Feb 2024) promoted to Chief Customer Success Officer joining Ivneet Kaur (joined December 2024 as Chief Technology and Product Officer) as Mambu's female executive leaders. 2024 announcements: December 5 2024 Mambu announced acquisition of Numeral (French payment technology provider for banks and fintechs), acquisition strengthens Mambu's position as industry leader and represents significant investment in next phase of Mambu's growth, Mambu released annual Partner Predictions Report for 2025 identifying key fintech trends including \"increased adoption of AI, embedded finance, and real-time payments\" and \"emerging regulations, blockchain, and alternative lending\", August 2024 Mambu launched Mambu Functions on AWS, Mambu recognized as market leader in 2024 by several analyst firms and introduced multitude of new features across lending, deposits, cards, payments and core platform. Q4 2024 product updates: to comply with new regulations requiring all Payment Services Providers (PSPs) in SEPA member states to process instant payments by January 2025, Mambu ensured compliance of payment processing system to streamline transactions, loan repayment schedules can now be customized by adjusting principal amounts and number of installments for loans using Declining Balance Equal Instalment (DBEI) interest method, customers can now create and dispatch 'Client webhooks' through Notifications Microservice, functionality available to new customers via Configuration as Code (CasC) and APIs with expansion to all Mambu customers planned for 2025.\n"
}