{
  "id": "5e1a10cc6f12e1369e56ab01333464b2ba1d8e4d",
  "source_url": "https://ndpc.gov.ng/",
  "source_type": "regulatory_compliance",
  "retrieved_at": "2025-12-03T10:35:41.223322+00:00",
  "metadata": {
    "jurisdiction": "nigeria",
    "regulation": "NDPR",
    "ttt_source": "url_verified",
    "certainty_level": "medium"
  },
  "content": "Nigeria Data Protection Commission – NDPC Skip to content info@ndpc.gov.ng No. 12 Clement Isong Street, Asokoro, Abuja X-twitter Facebook Instagram Linkedin Youtube Home About Us Who we are Structure Career Services DPCOs Registration & Requirements Licensed DPCOs Privacy Breach Reporting Data Controllers/Processors Registration Registered Data Controllers/Data Processors Of Major Importance Audit Filing Audited Firms Resources Media Centre Gallery News FAQs Contact Home About Us Who we are Structure Career Services DPCOs Registration & Requirements Licensed DPCOs Privacy Breach Reporting Data Controllers/Processors Registration Registered Data Controllers/Data Processors Of Major Importance Audit Filing Audited Firms Resources Media Centre Gallery News FAQs Contact Report a breach Call us +2349160615551 Latest News NDPC Hosts VPA Breakfast Meeting to Strengthen Nigeria’s Privacy Ecosystem NDPC Concludes Strategic French Visit, Explores Data Sovereignty Safeguards with IN Groupe, Thales, and Docaposte NDPC Shares Nigeria’s DPO Certification Model with French Counterparts for Global Competence Nigeria Deepens Data Governance Ties with France, Holds Bilateral Meetings with DINUM and CNIL in Paris nigeria data protection commission Championing privacy rights Read more Protect Your Privacy, Secure Your Future Building a data-secure Nigeria Read more . Our mission: We are committed towards making data privacy a cornerstone of sustainable digital economy in Nigeria Read more . Our vision: To be a resilient world class institution for the protection of data privacy Read more important links NDPC_DIAL White Paper Privacy by Design in Early Stage Innovation Read more Virtual Privacy Academy Read more NDP ACT GAID 2025 MARCH 20TH Read more Updated Guidance Notice Read more Data Controller/ Processor Registration Read more DPCOs Registration Read more Ready for outstanding services Get in touch // About us Guardians of Data Privacy Excellence The Nigeria Data Protection Commission (NDPC), established under the Nigeria Data Protection Act 2023, safeguards data privacy, enforces regulations, and promotes responsible data handling in Nigeria our core values 01 Fairness 02 Integrity 03 Accountability 04 Transparency Read more \"Let’s safeguard privacy together\" // Your Data, Your Power! Your Data Your Rights Your Rights as a Data Subject As a data subject under S.34 - S.38 of the NDPA, you have: Right to be informed Right to access Right to rectification Right to object to processing Right to report to supervisory authority Right to restrict processing Right to data portability Right to be forgotten Right not to be subjected to automated decision making Read More Your Responsibility as a Data Controller As an organization that determines the purpose and manner for processing data, your responsibility under S.29 of NDPA is to ensure methods by which data is collected is strictly in line with the principles of Data Protection. Read More Your Role as a Data Processor As a data processor under S.29 of NDPA, your role is to ensure that data processing is in accordance with the governing principles of processing data on behalf of the controller. Read More // Our Services Explore Our Services Data Controller/ Processor Registration Data Controller/ Processor Registration Click the button below to register as a Data controller/ processor. DPCOs REGISTRATION DPCOs REGISTRATION Click the tab below to know what DPCOs do, and steps and conditions of licensing applied. Privacy Breach Reporting Privacy Breach Reporting Click the button below to report a violation of your Data Privacy. LICENSED DPCOs LICENSED DPCOs List of duly licensed DPCOs. This list is updated as DPCOs are licensed by the Commission. Audited Firms Audited Firms Click the button below to preview the list of organizations that have complied with NDP Act. File an Audit File an Audit Click the button below to file your NDPR Audit Compliance Returns. Data Controllers/ Data Processors Of Major Importance Data Controllers/ Data Processors Of Major Importance Official list of Data Controller/ Data Processors Of Major Importance. This list is updated as DCPMI are approved by the Commission. // Facts About Us Ensuring data privacy and security for Nigeria's digital landscape. 0 + DPCOs 0 + Audited Reports Submitted 0 + Data Controller/Data Processor 0 Data Processor // From the Blog latest News 28 Nov news November 28, 2025 NDPC Hosts VPA Breakfast Meeting to Strengthen Nigeria’s Privacy Ecosystem 28 Nov news November 28, 2025 NDPC Concludes Strategic French Visit, Explores Data Sovereignty Safeguards with IN Groupe, Thales, and Docaposte 27 Nov news November 27, 2025 NDPC Shares Nigeria’s DPO Certification Model with French Counterparts for Global Competence Together, We Protect Your Data We’re Ready to Safeguard Your Data Contact Us Welcome to the NDPC. CHAMPIONING PRIVACY RIGHTS X-twitter Facebook Instagram Services Data Controllers/ Processors Registration DPCOs Registration Licensed DPCOs Privacy Breach Reporting Audited Reports Submitted File an Audit Newsletter info@ndpc.gov.ng +234 (0) 916 061 5551 Twitter NDPC Nigeria Follow Avatar Avatar NDPC Nigeria @ndpcngr · 20h The National Commissioner/CEO of the Nigeria Data Protection Commission (NDPC), Dr Vincent Olatunji, was a Guest Speaker at the 2025 annual conference of the Information Systems Audit and Control Association (ISACA), Lagos State Chapter. 2 Reply on Twitter 1995870391517233445 Retweet on Twitter 1995870391517233445 1 Like on Twitter 1995870391517233445 7 Twitter 1995870391517233445 Avatar NDPC Nigeria @ndpcngr · 20h The National Commissioner/CEO of the Nigeria Data Protection Commission (NDPC), Dr Vincent Olatunji, gave a goodwill message at the Zenith Bank Tech Fair 2025 themed, “Future Forward 5.0: Tech for Success – Innovate, Adapt, Accelerate,” held at the Eko Hotel and Suites in Lagos. 2 Reply on Twitter 1995858714860097713 Retweet on Twitter 1995858714860097713 3 Like on Twitter 1995858714860097713 11 Twitter 1995858714860097713 Avatar NDPC Nigeria @ndpcngr · 21h The Nigeria Data Protection Commission (NDPC) was represented on a panel session at Digital Nigeria 2025 by the Commission’s Head of IT & Cybersecurity, Mr Olorunisomo Isola, where he shared key insights on the topic, 2 Reply on Twitter 1995852737431699966 Retweet on Twitter 1995852737431699966 2 Like on Twitter 1995852737431699966 8 Twitter 1995852737431699966 Retweet on Twitter NDPC Nigeria Retweeted Avatar UK in Nigeria🇬🇧🇳🇬 @ukinnigeria · 26 Nov Focusing on cybersecurity, the UK is addressing supply chain security with @nitda, @galaxybackbone & @ndpcngr through robust threat intelligence and comprehensive risk assessments. Forging collaborations for secure, cost-efficient systems that boost economic growth. #GrowUKNG Reply on Twitter 1993639691195650474 Retweet on Twitter 1993639691195650474 13 Like on Twitter 1993639691195650474 31 Twitter 1993639691195650474 Avatar NDPC Nigeria @ndpcngr · 24 Nov The National Commissioner/CEO of the Nigeria Data Protection Commission (NDPC), Dr Vincent Olatunji, held a virtual meeting with the Trade Commissioner for Nigeria at Business Sweden, Ms Marlena Batist, on bilateral cooperation between the NDPC and Business Sweden. Cont... 2 Reply on Twitter 1992903046523695213 Retweet on Twitter 1992903046523695213 7 Like on Twitter 1992903046523695213 17 Twitter 1992903046523695213 Avatar NDPC Nigeria @ndpcngr · 24 Nov The Nigeria Data Protection Commission (NDPC) kicked off the Digital Privacy Awareness Campaign (DPAC), a nationwide awareness initiative aimed at enlightening the university community on the importance of data protection and privacy, at Nile University, Abuja. Cont... 2 Reply on Twitter 1992896112806470056 Retweet on Twitter 1992896112806470056 4 Like on Twitter 1992896112806470056 10 Twitter 1992896112806470056 Avatar NDPC Nigeria @ndpcngr · 24 Nov The Nigeria Data Protection Commission (NDPC) has signed a Memorandum of Understanding (MoU) with @smartcomply Technologies Solutions Limited on the compliance checklist for Small and Medium-sized Enterprises (SMEs). Cont... 2 Reply on Twitter 1992891298689290366 Retweet on Twitter 1992891298689290366 4 Like on Twitter 1992891298689290366 7 Twitter 1992891298689290366 Avatar NDPC Nigeria @ndpcngr · 17 Nov With respect to the #10KLaptopsProject, the NDPC, earlier today, engaged Dr Ayilola (@silverpenydr) and his team. The meeting aimed to guide them in handling personal data in line with the NDP Act 2023 and ensure that Nigerians’ information is properly protected and managed. 4 Reply on Twitter 1990486039123661024 Retweet on Twitter 1990486039123661024 255 Like on Twitter 1990486039123661024 1158 Twitter 1990486039123661024 Avatar NDPC Nigeria @ndpcngr · 15 Nov The National Commissioner/CEO of the Nigeria Data Protection Commission (NDPC), Dr Vincent Olatunji, will be the Keynote Speaker at the Maiden ALDAPCON Annual Data Protection Summit & AGM. Reply on Twitter 1989677043743654358 Retweet on Twitter 1989677043743654358 8 Like on Twitter 1989677043743654358 15 Twitter 1989677043743654358 Avatar NDPC Nigeria @ndpcngr · 10 Nov 🔒 Get Ready! National Privacy Week 2026 is coming! 📷 January 28 – February 4, 2026 Join the movement for data protection and privacy awareness. Reply on Twitter 1987851777023070440 Retweet on Twitter 1987851777023070440 10 Like on Twitter 1987851777023070440 25 Twitter 1987851777023070440 Avatar NDPC Nigeria @ndpcngr · 10 Nov The Nigeria Data Protection Commission (NDPC) participated in the 2025 Education Conference organised by the Catholic Archdiocese of Abuja, with the theme “Global Compact on Education: Reviving Our Commitment to the Younger Generation.” 2 Reply on Twitter 1987851317348335619 Retweet on Twitter 1987851317348335619 6 Like on Twitter 1987851317348335619 12 Twitter 1987851317348335619 Avatar NDPC Nigeria @ndpcngr · 10 Nov The National Commissioner/CEO of the Nigeria Data Protection Commission (NDPC), Dr Vincent O"
}