{
  "id": "75c5367dedd556445b99dea4bf81c714189ea9ed",
  "source_url": "if://research/migration-remittances/2025-12-03/part-9",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:47.554843+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 9
  },
  "content": "South Africa remains the most significant destination country in Africa, with around 2.9 million international migrants. Countries like South Africa, Gabon, Nigeria, C么te d'Ivoire, Algeria, Morocco, South Sudan, Sudan, and Djibouti are labor magnets due to their relatively higher wages, which attract many nationals from neighboring countries.\n\nThe South African remittance market is witnessing a surge in digital payment solutions, with over 50% of transactions now conducted online. Innovations such as mobile wallets and peer-to-peer transfer platforms have simplified cross-border transactions.\n\nIn Q1 2024, South Africa (7.08 percent) is the most expensive country in the G20 group to remit to, followed by China (6.61 percent).\n\n---\n\n## DOCUMENT 42: NIGER TRANSIT MIGRATION REMITTANCES\n\n**SOURCE_URL:** https://migrants-refugees.va/country-profile/niger/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Transit Migration\n**REGION:** West Africa (Niger)\n**CERTAINTY:** Medium\n\n**CONTENT:**\nNiger is positioned at the crossroads of the migratory routes of West and Central Africa. Thus, Niger has become one of the main transit countries for migrants originating from West and Central Africa, moving to North Africa, and migrating irregularly across the Mediterranean.\n\nThe majority of emigrants from Niger find themselves in Nigeria (37.8%), Libya (12.6%), C么te d'Ivoire (12.4%), Benin (8.3%), Ghana (7.7%), Togo (5.2%), and Cameroon (3.5%).\n\nRemittances originating from Africa to Nigeria account for 12.7% of total inflows, with the top six originating countries being Cameroon (23.4%), Ghana (17.2%), Togo (16.8%), South Africa (13.3%), Benin (8.6%) and Niger (5.6%).\n\nLabour migration in West Africa takes many forms, including temporary, seasonal and permanent migration, and implicates many sectors of employment, such as mining in Guinea, Burkina Faso, Mali, and Senegal.\n\nEvery year, thousands of seasonal workers from West and Central Africa travel to gold mining areas in Burkina Faso, Senegal, or Mali.\n\n---\n\n## DOCUMENT 43: GAMBIA CABO VERDE HIGH REMITTANCE DEPENDENCY\n\n**SOURCE_URL:** https://www.migrationdataportal.org/regional-data-overview/western-africa\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/High GDP Share\n**REGION:** West Africa (Gambia, Cabo Verde)\n**CERTAINTY:** High\n\n**CONTENT:**\nThe Gambia depends on remittances for over 21% of its GDP. Lesotho and Comoros also sit near the top of the list, with remittances making up around 20% of their economies.\n\nWestern African countries received 27 billion USD in remittances in 2020. Nigeria, the largest recipient in Sub-Saharan Africa in absolute terms, received nearly 64 per cent of this total (17.2 billion), while the Gambia (15.6 per cent) and Cabo Verde (13.9 per cent) received the most remittances as a share of GDP.\n\nIn some cases remittances represent more than 7% of the country's GDP. In three countries, this percentage is much higher: Liberia (20.4%), The Gambia (15.4%), and Senegal (11.4%).\n\nThe distribution of fintech innovation across the continent tells a paradoxical story: countries most dependent on remittances receive the least startup attention. New entrants face formidable competition from well-capitalized incumbents.\n\nOne in nine people on earth are affected by remittance flows. Roughly half reside in small towns and rural villages where remittances put food on the table, educate children, and support small businesses.\n\n---\n\n## DOCUMENT 44: MOZAMBIQUE REMITTANCE TRENDS\n\n**SOURCE_URL:** https://sihma.org.za/african-migration-statistics/country/mozambique\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Trends\n**REGION:** Southern Africa (Mozambique)\n**CERTAINTY:** High\n\n**CONTENT:**\nMozambique is ranked one of the top five countries that supply migrant labour to South Africa. As a result, remittance flow between South Africa and Mozambique constitutes one of the top four remittance corridors within the SADC region.\n\nAccording to the World Bank, Mozambique has enjoyed a steady increase in its remittances received from $93,372,690 in 2016 to $453,972,066 in 2021. As a percentage of GDP, remittance flow increased from 0.8% in 2016 to 2.8% in 2021 and dropped to 1.6% in 2022.\n\nRemittance flows to Sub-Saharan Africa are expected to have increased by about 1.9% in 2023 to $54 billion, driven by strong remittance growth in Mozambique (48.5%), Rwanda (16.8%), and Ethiopia (16%).\n\nThe marginal cost of sending USD200 from South Africa to Mozambique has decreased from 21.76 percent in Q3 2014 to 9.7 percent a decade later.\n\nIFAD is partnering with Mama Money under the PRIME Africa initiative to maximize the impact of remittances sent by low-income migrants in South Africa to their remittance receiving families in Mozambique and Zimbabwe.\n\nDiscussions highlighted the use of 'grey' remittance channels that blend formal infrastructure with informal practices, particularly within the Mozambican corridor.\n\n---\n\n## DOCUMENT 45: AFCFTA AND CROSS-BORDER PAYMENT HARMONIZATION\n\n**SOURCE_URL:** https://www.un.org/osaa/sites/www.un.org.osaa/files/files/documents/2024/publications/23343_un_policypaper_remittanceswestafrica_v04.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Regional Integration\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nThe AfCFTA Protocol on Digital Trade and cross-border payment systems like Pan-African Payment and Settlement System (PAPSS) offer a framework for harmonising rules, lowering costs and expanding formal remittance corridors.\n\nRemittance transfers sometimes exceed Official Development Aid (ODA) and Foreign Direct Investment (FDI) in some parts of the World such as Sub-Saharan Africa, demonstrating their importance for promoting socio-economic development.\n\nIn just over a decade, remittance inflows to Africa have surged from approximately US$53 billion in 2010 to roughly US$95 billion in 2024. This reflects an increase in their share of the continent's GDP from 3.6% to 5.1% over the same period.\n\nRemittance prices fell from 9.8 per cent in Q2 2016 to 8.2 per cent in Q1 2025, a drop of 1.6 percentage points. At this rate of progress Africa will fail to meet SDG 10.c which states that remittance prices will not average more than 3 percent by 2030 and no single corridor will be more than 5 percent.\n\nThe regulation of domestic infrastructure, the introduction of national switches, and their integration are essential. Countries must connect national switches, such as Tanzania's TIPS and Rwanda's RSwitch, to PAPSS and standardize AML/KYC regulations to improve interoperable digital infrastructure and promote local currency settlement.\n\n---\n\n## SUMMARY STATISTICS\n\n**Total Documents Analyzed:** 45\n**Geographic Coverage:** 30+ African countries\n**Key Corridors Identified:** 15+\n**Major Topics Covered:**\n- Intra-African Migration (South Africa-SADC, Burkina Faso-C么te d'Ivoire, etc.)\n- Seasonal Migration (Fulani, Maasai, Fishing Communities, Agricultural Workers)\n- Africa to Europe/Gulf States/USA Migration\n- Remittance Costs and Volumes ($100+ billion annually)\n- Mobile Money (M-Pesa, MTN MoMo, GSMA data)\n- Informal Channels (Hawala, informal transfers 35-75% of formal flows)\n- Regulatory Frameworks (BCEAO, CBN, CBK, AML/CFT)\n- Financial Service Opportunities (MFI products, credit scoring, insurance)\n- Technology Solutions (PAPSS, blockchain, digital identity)\n- Major Providers (Western Union, MoneyGram, WorldRemit, Chipper Cash, LemFi)\n\n**Key Findings:**\n- Africa received $96-100 billion in remittances in 2024, exceeding ODA and FDI\n- Average cost to send remittances to Africa: 8.4% (Q1 2024), far above 3% SDG target\n- Mobile money dominates in East Africa (60%+ of remittances digital)\n- Informal channels account for 35-75% of formal remittance volumes\n- South Africa-Zimbabwe corridor is largest in SADC region ($296M annually)\n- Burkina Faso-C么te d'Ivoire is 2nd largest migration corridor in Africa (1.3M migrants)\n- Nigeria receives $19.8B (largest SSA recipient), Egypt $22.7B (largest Africa)\n- Kenya achieved 97/100 MobileRemit index score\n- PAPSS connected 18 countries, 14 national switches, 150+ banks by 2025\n- Ethiopia, Kenya, Morocco, Senegal are only countries publishing corridor-level data\n\n**Research Date:** 2025-12-03\n**Sources:** World Bank, KNOMAD, GSMA, AfDB, IOM, IFAD, UNCDF, Central Banks, Academic Research\n"
}