{
  "id": "b242705c23e4660113a9408c84ae8b1fd76a7c7a",
  "source_url": "if://research/migration-remittances/2025-12-03/part-4",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:45.854688+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 4
  },
  "content": "The hundi is a related financial instrument that developed on the Indian sub-continent for use in trade and credit transactions. Hundis are used as a form of remittance instrument to transfer money from place to place, as a form of credit instrument or IOU to borrow money and as a bill of exchange in trade transactions.\n\nSomalia has not had a functional banking system since the outbreak of the civil war in 1991. In the absence of banks, Hawala remittance companies emerged as a means of transferring money from the diaspora to Somalia. According to the CIA, with the dissolution of Somalia's formal banking system, many informal money transfer operators arose to fill the void. It estimates that such hawaladars, xawilaad or xawala brokers are now responsible for the transfer of up to $1.6 billion per year in remittances to the country, most coming from working Somalis outside Somalia.\n\nHawala serves as a \"lifeline\" to people in Somalia. Remittances sent from members of the diaspora to individuals in Somalia are used for necessities like food, healthcare, and education. More than 20 money transfer operators (MTOs) operate in Somalia today, with the market dominated by three main players: Dahabshiil, Amal Express, and Taaj.\n\nMany remittance companies transfer money to other East African nations, including Kenya, Ethiopia, Djibouti, and Sudan. According to Tawakal Express, a remittance agent with over 600 offices worldwide, money transfers can be made to Somalia, Ethiopia, Kenya, Sudan, and Eritrea. Hawala agents operate in \"poor and remote areas\" that are \"out of reach of the formal financial sector.\"\n\nHawala is a form of informal money transfer outside the banking system whereby Ethiopians in the diaspora remit foreign currency to middlemen, who pay the chosen beneficiary in Ethiopia in local currency at the black market rate. In August 2022, the Ethiopian National Intelligence and Security Service (NISS) reported the arrest of several Ethiopian and foreign nationals allegedly involved in illicit financial flows and illegal hawala.\n\nMany countries and communities, as well as the development community, view hawala systems as essential providers of financial services to the unbanked in countries with limited financial access. In significant numbers of jurisdictions and sometimes in the same jurisdiction, law enforcement views them as one of the leading channels for terrorist financing and money laundering.\n\nHawala-type informal transfers are often faster, more reliable, reach more destinations, sometimes benefit from a better exchange rate, and can be much cheaper than transfers through established, licensed financial institutions.\n\nThe different anti-money laundering regulations in various countries make it impractical to regulate the fund transfer system; in some countries, it is prohibited while in some, it is not. Policymakers need to either license or come up with registration policies for the system to make the regulation process more effective.\n\n---\n\n## DOCUMENT 19: BCEAO WEST AFRICA REMITTANCE REGULATIONS\n\n**SOURCE_URL:** https://www.gide.com/en/news-insights/nouvelle-reglementation-des-changes-en-zone-uemoa-une-reforme-discrete-qui-renforce-le-controle-de-la-bceao-et-accentue-les-complexites-administratives-dans-la-region/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Regulatory/West Africa\n**REGION:** WAEMU/BCEAO Zone\n**CERTAINTY:** High\n\n**CONTENT:**\nThe West African Economic and Monetary Union (WAEMU) introduced a new foreign exchange regulation marking a major step in modernizing its regulatory framework. Introduced at the end of 2024, the reform gives the BCEAO tighter control of financial flows as part of the region's drive to counter money laundering and the financing of terrorism (AML-CFT). Adopted on 20 December 2024, the regulation on foreign exchange replaces the previous 2010 regulation.\n\nThe reform clarifies and strengthens the repatriation and foreign currency transfer requirements. WAEMU residents must repatriate income from foreign investments and loans and deposit it in their local bank accounts. In 2023, only 74% of the export revenue from outside the Union was returned to the Central Bank. To counter this, the new 2024 regulation sets strict rules: export earnings must be fully repatriated in two stages - first collected by an authorized intermediary (such as a local bank), then transferred to the BCEAO.\n\nWAEMU residents require prior approval from the Ministry of Finance, after confirmation by the BCEAO, to open a foreign currency account either within or outside the region. Another key measure is increased monitoring of foreign currency accounts held abroad. Until now, businesses and individuals could open accounts outside the WAEMU area with some level of opacity. The new regulation now requires prior approval from the Ministry of Finance, after validation by the BCEAO.\n\nBCEAO regulations require both mobile money and OTC service agents to register their businesses in the Registry of Trade and Property Credit or another equivalent registry. The same requirements apply to merchants who accept mobile money payments.\n\nIn 2015, BCEAO adopted new e-money regulatory guidelines. These guidelines clarified the roles and obligations of different stakeholders along the e-money value chain and set clear limits on the scope of activity allowed in mobile money accounts. By prohibiting agent exclusivity and setting clear obligations for price transparency, transaction values, distribution rights, and personal data protection, the guidelines also strengthen consumer protection.\n\nPayment providers now have until August 31, 2025, to obtain official approval to operate legally in the West African Economic and Monetary Union (WAEMU). With this licensing effort, the BCEAO hopes to better organize digital finance services while still supporting innovation and broader access to financial tools. As of May 27, 2025, a total of 11 companies had received their licenses.\n\nFinancial inclusion in WAEMU has improved but remains below the Sub-Saharan average. Some 43 percent of the adult population has access to a transaction account. This is an improvement compared to the 8 percent of a decade ago, though performance is still below the Sub-Saharan African average of 55 percent.\n\n---\n\n## DOCUMENT 20: CENTRAL BANK NIGERIA KENYA REMITTANCE LICENSING\n\n**SOURCE_URL:** https://aln.africa/insight/cbn-revised-guidelines-for-international-money-transfer-services/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Regulatory/National\n**REGION:** Nigeria, Kenya\n**CERTAINTY:** High\n\n**CONTENT:**\n\n**NIGERIA:**\nThe Central Bank of Nigeria (CBN) on 31 January 2024 released the revised Guidelines for International Money Transfer Services in Nigeria, which effectively repealed the previous guidelines issued in 2014. The Guidelines were issued in light of the recent reforms to liberalise the foreign exchange market, and with the aim to boost diaspora remittances and other foreign capital inflows to Nigeria.\n\nUnlike the 2014 Guidelines, the new Guidelines prescribe a two-level approval for a prospective IMTO licencee: Approval-in-Principle (AIP) and Final Approval.\n\nThe services include cross border personal money transfer services, such as money transfer services towards family maintenance, or in favour of foreign tourists visiting Nigeria. The money transfer shall target individual customers and the transaction shall be on \"person to person\", \"business to person\" and \"business to business\" transfer basis.\n\nOne key highlight of the New IMTO Guidelines is the prohibition of banks and financial technology companies (fintech companies) from operating international money transfer services. While fintech companies are prohibited from offering international money transfer services, banks are permitted to act as agents to IMTOs duly licensed by the CBN.\n\nAll in-bound money transfers to Nigeria shall be paid to beneficiaries in Naira only through a bank account or cash. IMTOs shall use the prevailing exchange rate at the Nigerian Foreign Exchange Market on the day the transfer is received. Where the amount exceeds the equivalent of USD 200, payment shall not be made in cash, but through an account.\n\n**KENYA:**\nCross-border payments and remittances are regulated by the Money Remittance Regulations, under which any person who wishes to undertake \"money remittance business\" is required to obtain a licence from the CBK. \"Money remittance business\" is defined as a service for the transmission of money or any representation of monetary value without any payment accounts being created in the name of the payer or the payee.\n\nLicensing under Money Remittance Regulations (2013) governs the establishment and operation of Money Remittance Operators (MROs). To provide money remittance services, a firm must be incorporated as a limited liability company and obtain an MRO license.\n\nBanks and deposit-taking microfinance institutions are exempted from the Money Remittance Regulations and can undertake cross-border payments and remittances without the need to obtain a money remittance licence.\n\nA money remittance operator must maintain an account entitled 'Customer's account' in the name of the licensee at any commercial bank. All foreign exchange inflows and outflows of money remittance operators must be received through commercial banks, documented and advised to the Central Bank in the prescribed format.\n\nKenya is globally recognized as the birthplace of mobile money innovation, thanks to M-Pesa. Over 90% of adults in Kenya use M-Pesa. Remittances can go directly into M-Pesa wallets—accessible within seconds. The Central Bank of Kenya authorizes who can handle international transfers.\n\n---\n\n## DOCUMENT 21: AML CFT COMPLIANCE IMPACT ON AFRICA REMITTANCES\n\n**SOURCE_URL:** https://migrantmoney.uncdf.org/wp-content/uploads/2025/05/AML-CFT-Guidelines-for-RSPs_May2025.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Regulatory/AML-CFT\n**REGION:** Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nAML/CFT compliance requirements have created a marked increase in cost and complexity to banks globally. While many of these regulatory changes have increased financial system resilience and helped battle financial crime, they have also put increased pressure on correspondent banking relationships. These correspondent banking networks make trade possible, support remittances, and facilitate foreign currency settlements.\n\nOver 25 percent of 300-plus banks in over 90 emerging markets reported correspondent bank relationship losses. Seventy-two percent of the banks covered by the study reported that they face exogenous challenges – primarily correspondent banking stress and related compliance challenges.\n\nIn Africa, pan-African collaborations focus on cross-border cooperation and closer alignment with FATF recommendations. AML/CFT regulatory frameworks have been in place across most countries, and these countries are committed to improving their AML/CFT regimes. Most regulatory frameworks cover vital AML/CFT aspects, including cross-border cash transportation, bearer negotiable instruments, and financial transaction transparency.\n\nWhen the FATF places a jurisdiction under increased monitoring (also known as grey listing), it means the country has committed to resolve swiftly the identified strategic deficiencies. The FATF published their decision to include South Africa on its grey list on 24 February 2023. The FATF has identified South Africa as having a high risk for money laundering and terrorist funding due to its cash-based economy, which makes it difficult to track financial transactions, and weak border controls.\n\nMeasures include watchlist screening against FATF-recommended sanction lists to detect possible terrorism financing activity, including lists issued by the United Nations, European Union, His Majesty's Treasury, and the US Office of Foreign Assets Control. FATF Recommendation 14 on money or value transfer services requires countries to ensure that providers are licensed or registered and subject to effective compliance systems.\n\nMoney remittance and currency exchange services are vulnerable to financial crimes due to their global reach and other factors. These providers deal with millions of small transactions on a daily basis, which are complex to monitor and make them less transparent.\n\nIn 2025, AML compliance faces landmark shifts. New guidelines from the Financial Action Task Force (FATF) emphasize enhanced National Risk Assessments (NRA) and transparency in beneficial ownership, pushing financial institutions to modernize or risk stiff fines, reputational damage, and legal repercussions.\n\n---\n\n## DOCUMENT 22: MICROFINANCE REMITTANCE-LINKED SAVINGS PRODUCTS\n\n**SOURCE_URL:** https://migrantmoney.uncdf.org/partners/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/MFI Products\n**REGION:** Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nIFAD is partnering with APS under the PRIME Africa initiative to accelerate the uptake of digital remittance services among remittance recipients, and to remittance-linked microfinance services. IFAD is partnering with Fidelity Bank Ghana under the PRIME Africa Programme initiative to enable remittance recipients in high-migration rural areas to increase their share of remittances saved in formal bank accounts. By targeting un(der)banked remittance recipients, Fidelity Bank is enabling termination of remittances directly into a savings account.\n\nWith support from UNCDF, Wizall Money aims to improve lives of migrants and their families in four countries of the West Africa region (Burkina Faso, Ivory Coast, Mali and Senegal) by improving its remittance linked products: Wallet remittance termination, Nanocredit for migrants and their families, and Insurance for migrant family members.\n\nIFAD is partnering with Stanbic Bank Uganda (SBU) under the PRIME Africa initiative to promote affordable digital remittances in rural Uganda. In 2021, SBU launched a new e-wallet named FlexiPay, with a simplified onboarding process that facilitates un(der)banked clients. The microfinance pioneer Foundation for International Community Assistance (FINCA International) also introduced a card-based solution and piloted the use of POS terminals in its branches in rural Uganda. FINCA International issued nearly 3,000 debit cards to its clients, enabling real-time authorization and processing of transfers at fees among the lowest in the country.\n\nIFAD is partnering with Mama Money under the PRIME Africa initiative to maximize the impact of remittances sent by low-income migrants in South Africa to their remittance receiving families in Mozambique and Zimbabwe. The project responds to the growing need of migrant workers in South Africa to maximize their net income.\n"
}