{
  "id": "f103dd70c1020a090b86a74be3661e6ccf778bf5",
  "source_url": "if://research/migration-remittances/2025-12-03/part-6",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:46.543147+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 6
  },
  "content": "In Africa, a new variant is emerging: the EMDE (Emerging Market and Developing Economy) stablecoin. Pegged to local currencies and backed by a mix of hard-currency reserves and real housing assets, these tokens connect foreign investors and local borrowers within a transparent, programmable ecosystem.\n\nIn Sub-Saharan Africa, fewer than 3% of adults hold a mortgage; in Nigeria or Uganda, closer to 1%. Most families earn income informally, through trade, gig work or remittances—cash flows too irregular for banks to assess.\n\nA distributed ledger (also called a shared ledger or distributed ledger technology or DLT) is a system whereby replicated, shared, and synchronized digital data is geographically spread (distributed) across many sites, countries, or institutions. In contrast to a centralized database, a distributed ledger does not require a central administrator, and consequently does not have a single (central) point-of-failure.\n\nImporters and exporters can have peace of mind when dealing with clients in distant countries, where the language and business culture may be very different. The entry into the ledger of dispatch information, shipping details, customs declarations and payments, fees payments, transit locations and final delivery all serve to greatly enhance transparency, and consequently, trust. A DLT-driven trade details ledger will also speed up cross-border trade considerably.\n\nDLT holds much promise for the world of global trade. In many ways, Africa stands to benefit more than the developed world, in a relative sense, because Africa can transfer the technology when it is ready and skip many of the intermediate steps—similar to how Africa benefited by skipping the landline phase of internet connectivity and moving directly to wireless smart devices.\n\nThe future of money is digital, regulated and interoperable. The Universal Digital Payments Network (UDPN) is a DLT-underpinned messaging backbone focused on providing interoperability between regulated stablecoins and, in the future, CBDCs, offering lower payment costs than traditional solutions.\n\n---\n\n## DOCUMENT 28: DIGITAL IDENTITY MIGRANTS CROSS-BORDER KYC\n\n**SOURCE_URL:** https://migrantmoney.uncdf.org/resources/insights/central-bank-led-digital-id-to-drive-cross-border-payments-and-financial-inclusion/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Digital Infrastructure\n**REGION:** Southern Africa (SADC), Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nThe challenge facing Southern Africa exemplifies why DPI matters: 3.7 million SADC nationals living outside their home countries face systematic financial exclusion despite most member states having foundational digital identity systems. Poor interoperability between national ID platforms and financial service providers creates barriers that force millions to rely on informal, cash-based transactions.\n\nThe SADC Committee of Central Bank Governors, FinMark Trust and Co-Develop have announced a strategic partnership to build a federated electronic Know Your Customer (eKYC) ecosystem spanning 16 member states. The partnership builds on validated results from FinMark Trust's pilot programme between Lesotho and South Africa, which successfully demonstrated real-time, cross-border identity verification. Lesotho migrants were able to access formal remittances services in South Africa using their national digital IDs.\n\nNearly half a billion Africans still lack a foundational ID. While approximately 85% of African countries have national ID systems with some digital capabilities, and over 70% collect biometric data for authentication, full inclusion remains an uphill climb. About 100 million people in Sub-Saharan Africa don't have access to formal identification documents, a barrier to adopting regulated and finance platforms.\n\nIdentification is the cornerstone of financial services, as all financial service providers must verify their customers' identity under 'know-your-customer' (KYC) rules. These guidelines require individuals to present official identification documents to open accounts and conduct transactions. However, in many jurisdictions, a significant number of people lack the necessary identity documents, preventing them from accessing financial services.\n\nDigital IDs simplify KYC processes, enabling more people to access financial services and formal remittance channels, leading to faster and more secure cross-border transactions.\n\nThe Economic Community of West African States (ECOWAS)'s National Biometric ID Card is another example of encouraging the free movement of people in the region by replacing residential permits and removing the need to use visas.\n\nAt the heart of this vision is a transformative idea: A unified digital identity system — Africa's own KYC (Know Your Customer) — is the foundation for a digital single market.\n\nMastercard has extended its strategic commercial partnership with Smile ID, an identity verification provider in Africa to accelerate the rollout of secure digital identity solutions across the continent. This partnership will enable banks, fintechs, mobile money operators and other enterprises to onboard new customers faster, reducing identity fraud and expanding access to the financial system.\n\nAs Africa's digital economy is projected to reach $1.5 trillion by 2030, trusted identity solutions are a critical enabler of financial inclusion, fraud prevention, and cross-border commerce.\n\nDespite these promises, concerns over privacy, security, and exclusion are growing. Critics, including Privacy International and Access Now, have raised alarm over the risks posed by poorly regulated digital ID systems.\n\n---\n\n## DOCUMENT 29: TOP AFRICAN REMITTANCE RECEIVING COUNTRIES 2024\n\n**SOURCE_URL:** https://visual-nerd.com/2025/01/21/top-remittance-receiving-countries-2024/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Major Recipients\n**REGION:** Egypt, Morocco, Ghana, Kenya\n**CERTAINTY:** High\n\n**CONTENT:**\nRemittances sent by the African diaspora reached a historic figure of USD 100 billion in 2024. According to the World Bank, over $96.4 billion flowed into Africa in remittances, which is approximately twice the level of overseas development assistance.\n\n**EGYPT:**\nEgypt maintained its position as Africa's leading recipient of remittances in 2024, with inflows reaching $22.7 billion. This significant increase was driven by economic reforms, including the liberalization of exchange rates and higher interest rates on savings instruments, which encouraged Egyptians abroad to utilize formal banking channels.\n\n**MOROCCO:**\nRemittances to Morocco totalled $12.0 billion in 2024. Morocco's diaspora contributed $12.05 billion in remittances in 2024, reflecting the strong ties between Moroccans abroad and their homeland.\n\n**KENYA:**\nKenya saw a record $4.94 billion in remittances in 2024, marking an 18% increase from the previous year. The United States remained the largest source, contributing 51% of total inflows. The Kenyan government has actively encouraged labor migration, with President William Ruto promoting opportunities abroad to address domestic unemployment. Remittances have become Kenya's largest source of foreign exchange, surpassing tourism and agricultural exports.\n\n**GHANA:**\nGhana recorded $4.6 billion in remittances. Ghana received $4.6 billion in remittances in 2024, underscoring the significant role of its diaspora in supporting the national economy. These funds are essential for household consumption, education, and healthcare, and they contribute to poverty reduction and economic stability.\n\nEgypt, Nigeria and Morocco accounted for the largest shares of Africa's remittance inflows in 2024. Regionally, North and West Africa attracted the highest overall remittance volumes. Remittance inflows continue to grow with a 7% Compound Annual Growth Rate (CAGR) in the 3 years to 2024 despite global headwinds.\n\n---\n\n## DOCUMENT 30: AFRICAN DEVELOPMENT BANK REMITTANCE PROGRAMS\n\n**SOURCE_URL:** https://www.afdb.org/en/topics-and-sectors/initiatives-partnerships/migration-and-development-initiative\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Development Programs\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nThe African Development Bank has assigned a high priority to the promotion of remittance flows as a development tool and a link to the private sector. The overall objective of AfDB's Initiative on Migration and Development is to maximize the development impact of remittances by increasing their canalization into productive investments and promoting business opportunities and job creation at the grassroots level.\n\nAfDB aims to support the development of financial services for migrant workers and create incentives to channel funds into productive uses in the country of origin.\n\nIn 2009, the AfDB hosted the Migration and Development multi-donor trust fund in support of its initiative \"Migration and Development.\" As a joint initiative by the AfDB and France, the Fund finances activities aimed at improving knowledge on migrants' remittances in Africa; assisting the reform of regulatory frameworks in order to improve the conditions of transfer; developing new financial products that respond better to the needs of migrants, and supporting the initiatives of migrants in productive investment and local development in their country of origin.\n\nThis meets the recommendations of the G20 to reduce transfer costs and to promote financial inclusion. The initial contributors are France (EUR 6 million) and IFAD (USD 200,000).\n\nThe program assists the reform of regulatory frameworks by modernizing regulatory frameworks and operators to enhance financial markets for the benefit of migrants and beneficiaries. It also focuses on developing and testing new financial products that respond better to the needs and capacities of migrants and beneficiaries, which can be risky and expensive for financial intermediaries, particularly microfinance institutions.\n\nOne main objective is to promote the financial intermediaries' engagement through cofinancing or other forms of support. Another component aims to assist migrants in the creation of SMEs and promote the creation of private equity and investment funds for advancing innovative SME projects that involve migrants and local entrepreneurs.\n\nAn estimated 30 to 40 percent of remittances to Africa are sent to rural areas where banking facilities are generally non-existent. As a result, people travel long distances to receive their money. This cost of travel represents an additional burden to the already high cost of transfer. Expanding payment networks to small-scale merchants and encouraging the adoption of new technologies such as payments through the Internet or mobile phones can widen the reach of remittances and enhance financial inclusion.\n\nRemittances play a vital role in many African economies. From being the second largest source of external financial flows between 1980 and 2000, ranking between Official Development Assistance (ODA) and Foreign Direct Investment (FDI), they have surpassed ODA and FDI flows since 2010.\n\nMore than 1 in 4 people in Sub-Saharan Africa lack access to financial services, which limits their ability to overcome persistent and new crises, notably conflict, climate disruptions and migration.\n\nAs stated by AfDB President Dr. Akinwumi Adesina, \"The African diaspora has become the largest financier of Africa! And it is not debt; it is 100% gifts or grants, a new form of concessional financing that is the key for livelihood security for millions of Africans.\"\n\n---\n\n## DOCUMENT 31: LESOTHO REMITTANCES SOUTH AFRICA MINING WORKERS\n\n**SOURCE_URL:** https://scholars.wlu.ca/samp/45/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Mining Labor/Circular Migration\n**REGION:** Lesotho-South Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nLesotho is one of the most migration dependent countries in the world. Migrant remittances are the country's major source of foreign exchange, accounting for 25% of GDP in 2006. According to the World Bank, the remittances received in 2020 constituted 25.1 percent of the Lesotho GDP.\n\nIt would be difficult to exaggerate the significance of labor migration in Lesotho's economy. Over a quarter of the male labor force of Lesotho is engaged in mine employment in South Africa. These workers are typically on fixed-term contracts spanning 12 months which require them to return to Lesotho before a renewal.\n\nThe migrants' remittances make up over 80% of factor income from abroad which constituted 40% to 50% of Lesotho's gross national product during 1983–91. At the household level, remittances from migrant laborers in South Africa are the main source of income for about 35% of homesteads and 70% of households have had at least one member as a migrant worker.\n\nThe number of Basotho male migrants working on the mines declined from 100,000 in 1990 to 46,000 in 2006. However, the majority of male migrants from Lesotho are still mineworkers. The backbone of Basotho remittances from South Africa has traditionally been the mining industry, which employed large numbers of Basotho. However, these numbers have declined rapidly. For example, while almost 65,000 Basotho were employed on South African mines in 2000, by 2015 that number had declined to only 27,948. By late 2010, the number of mineworkers from Lesotho was estimated to be fewer than 43,000.\n\nMigrants used to be single young men. Now 84% are married and 77% are heads of households. Nearly 50% of migrants are over the age of 40 and only 5% are under 25.\n\nThe vast majority of cash remittances flow through informal channels (usually carried by hand). In 2001 in Lesotho, remittances were estimated to contribute as much as 26.5% of GDP. To encourage remittances, under bi-lateral agreements, Lesotho and Mozambican mineworkers receive part of their pay as deferred pay.\n\nHalf of the growing number of female migrants from Lesotho are domestic workers in South Africa. The rest are spread between the informal sector (9%), commercial farmwork (5%), self-employed businesses (6%), the professions (5%) and skilled manual work (5%). Female domestic workers in South Africa remit less to Lesotho than male miners. This is primarily because they earn about a third as much as their male counterparts.\n\nAs a percentage of GDP, Lesotho was the highest recipient of remittances in the sub-region in 2019. The consequences for Lesotho of the end of new legal migration to work in South African mines and the retrenchment of migrants have been devastating. They have been exacerbated by population growth, political instability, drought, continuing soil erosion, and the peculiarities of the country's limited economic development.\n\n---\n\n## DOCUMENT 32: SENEGAL MALI GUINEA REMITTANCES WEST AFRICA\n\n**SOURCE_URL:** https://www.migrationdataportal.org/regional-data-overview/western-africa\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Corridors"
}