{
  "id": "98518d780cf75f79a92709c1d81cb18769470ce1",
  "source_url": "if://research/migration-remittances/2025-12-03/part-8",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:47.217302+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 8
  },
  "content": "Policymakers must work to make sure remittance service providers do not face difficulties in partnering with correspondent banks. Opening access of money transfer operators (MTOs) to partnerships with national post offices, national banks, and telecommunications companies could help remove entry barriers and increase competition in remittance markets.\n\nReducing remittance costs can be achieved by removing exclusivity arrangements in the money transfer industry, facilitating the entrance of new players into the market, harmonizing competition regulatory frameworks, reducing bond and capital requirements, promoting new technologies, and developing the payment systems infrastructure.\n\n---\n\n## DOCUMENT 37: FAMILY FINANCIAL SERVICES DIASPORA PRODUCTS\n\n**SOURCE_URL:** https://www.un.org/osaa/news/digital-remittances-africa\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Financial Products\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nRemittances serve as a vital lifeline for more than 200 million Africans. Beyond supporting the lives and livelihoods of families in the senders' countries of origin, these transfers represent solidarity and symbolize the generosity and resilience of the African community on the continent and beyond. In 2023, Africa received $100 billion in remittances, equaling nearly 6 per cent of the continent's GDP and exceeding Official Development Assistance ($42 billion) and Foreign Direct Investment ($48 billion).\n\nDigital remittances, particularly mobile money, have emerged as the most cost-effective way for families to send and receive money. The development of user-friendly mobile applications compatible with basic smartphones in many African countries fueled this growth, expanding the reach of digital remittance services to areas lacking traditional banking infrastructure.\n\nPartnerships between money transfer operators and local financial institutions allow unbanked individuals to access other financial services, such as credit, insurance, and savings accounts.\n\nMigrants and diaspora contribute through direct investments, skills transfer, and knowledge networks, further enhancing economic and social development in their countries of origin. Providing appropriate investment instruments and vehicles is crucial to facilitate the diaspora's appetite and ability to invest, particularly in countries and regions facing challenges to mobilize capital.\n\nDeveloping remittance ecosystems around basic social services like education and health can also help lower remittance transfer costs, with service providers able to offer bundled services at lower costs. For instance, remittance operators can work with local providers to propose an education and healthcare combo that includes tuition coverage, school supplies fees and health insurance subscription. While reducing remittance costs, this strategy also increases financial inclusion, facilitating access to education and health services in the recipient countries.\n\nKenya is the third largest remittance recipient in sub-Saharan Africa and the fifth largest receiving country in Africa. In 2023, according to the Central Bank of Kenya, remittance flows reached almost US$4.2 billion, accounting for nearly 3.6 per cent of the country's GDP and representing a leading source of foreign exchange. The Kenyan Government established The State Department for Diaspora Affairs (SDDA) under the Ministry of Foreign Affairs. Its mandate includes specific references to supporting remittances and diaspora investments in Kenya.\n\nMore and more African fintechs are diversifying their products and services to capture a bigger chunk of the global remittance market, majorly with the goal of enhancing the ability of the African diaspora to send money directly to their families quickly, securely, and more affordably.\n\nThe large gap left unattended by bank branches leaves a large market for remittance apps to capture, and they have been capturing it quite well. Since 2011, the rate of adults owning a financial account in sub-Saharan Africa has more than doubled, as about half of the population now owns an account.\n\nEstablished in 2006 at the United Nation's International Fund for Agricultural Development (IFAD), the Financing Facility for Remittances (FFR) is a multi-donor facility. The FFR finances and supports projects that spur innovation and improvements to global and domestic remittance markets with a focus on maximizing the development impact of migrant financial contributions to their families and communities that receive them, particularly in rural areas.\n\nThe cost to send money to Kenya remains high. The current average cost of sending US$200 to Kenya is 9.15 per cent of the amount sent (World Bank Q4 2023). Sending money to some African countries, such as Angola, Botswana and Namibia, can sometimes cost as high as 20 per cent of the amount transferred.\n\n---\n\n## DOCUMENT 38: INSTANT PAYMENTS REAL-TIME CROSS-BORDER AFRICA\n\n**SOURCE_URL:** https://www.citigroup.com/global/insights/the-future-of-cross-border-payments-in-africa\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Payment Infrastructure\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nAfrica's cross-border payments market is on track to more than triple over the next ten years, from about $329 billion in 2025 to $1 trillion in 2035, according to a report by Oui Capital. The report estimates a compound annual growth rate of 12% for the period.\n\nWhile 90 percent of payments on Swift's network reach their destination within the hour, the proportion of end-to-end transactions settling within that time is much less, because of issues in the last mile. At the heart of the issue is the so-called last mile — the final stretch of a cross-border payment that too often bottlenecks due to incompatible financial systems, basic errors in payment data, or regulatory divergence between countries.\n\nSwift GPI lets you make high-speed cross-border payments in minutes or seconds. Nearly 60% of Swift GPI payments are credited to end beneficiaries within 30 minutes and almost 100% within 24 hours.\n\nThe Pan-African Payment and Settlement System (PAPSS) will allow instant cross-border payments in local currencies. Meanwhile, the African Continental Free Trade Area aims to harmonize financial systems across the region, which would reduce the need for international intermediaries like SWIFT and help lower costs further.\n\nIn November 2025, Rwanda and Tanzania commenced bi-lateral discussions to link their national retail payment systems switches, marking a crucial step toward enabling instant, low-cost cross-border money transfers. This initiative will connect Tanzania's Instant Payment System (TIPS) with Rwanda's National Payment Switch (RSWITCH). Once operational, the linkage will allow individuals and businesses in both countries to send and receive money between bank accounts and mobile money wallets seamlessly and in real time.\n\nFintech startups are playing a major role in cutting transaction costs. For small businesses and freelancers, these companies offer services that reduce fees by up to 90%. Blockchain-based solutions are going a step further, bringing transaction costs close to zero.\n\nA U.S. fintech can pay gig workers in Kenya to M-Pesa wallets in seconds, and an e-commerce platform can settle instantly with sellers in Brazil via PIX, through single API connections powered by real-time connectivity.\n\n\"Africa can never be approached with a blanket solution,\" notes an Onafriq executive. \"What works in Kenya will not work in South Africa. Kenya is defined by mobile money; South Africa is defined by cards and neobanks. Uganda is still heavily cash-driven.\"\n\n\"The infrastructure is there. Now we need to make it interoperable,\" said Olivier Lens, head of Sub-Saharan Africa for Swift.\n\n---\n\n## DOCUMENT 39: WEST AFRICA CAMEROON BENIN TOGO REMITTANCES\n\n**SOURCE_URL:** https://www.un.org/osaa/sites/www.un.org.osaa/files/files/documents/2024/publications/23343_un_policypaper_remittanceswestafrica_v04.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/West Africa Corridors\n**REGION:** West Africa (Cameroon, Benin, Togo)\n**CERTAINTY:** High\n\n**CONTENT:**\nAs of mid-year 2020, 64 per cent of migrants from Western Africa lived in another country in the region, down from 80 per cent as of mid-year 1990. Over 90 per cent of migrants from Niger and over 75 per cent of migrants from Benin, Côte d'Ivoire, Mali, and Togo live in another country in Western Africa.\n\nUN data show that 2 out of 3 migrants from West African countries migrate within the region and about 90% of the 7.4 million international migrants in West Africa are migrants from West African countries.\n\nWestern African countries received 27 billion USD in remittances in 2020. Nigeria, the largest recipient in Sub-Saharan Africa in absolute terms, received nearly 64 per cent of this total (17.2 billion), while the Gambia (15.6 per cent) and Cabo Verde (13.9 per cent) received the most remittances as a share of GDP.\n\nIn just over a decade, remittance inflows to Africa have surged from approximately US$53 billion in 2010 to roughly US$95 billion in 2024. This reflects an increase in their share of the continent's GDP from 3.6% to 5.1% over the same period.\n\nRemittance flows in 2022 in West Africa demonstrated a significant pattern and resilience, with Nigeria being the primary recipient of almost $21 billion, accounting for over 60 per cent of the subregion's inflows.\n\nRemittance prices fell from 9.8 per cent in Q2 2016 to 8.2 per cent in Q1 2025. At this rate of progress Africa will fail to meet SDG 10.c which states that remittance prices will not average more than 3 percent by 2030 and no single corridor will be more than 5 percent.\n\nIn Q1 2025 it cost 8.9 per cent to send to Southern Africa compared to 9.9 per cent to send to East Africa and 5.9 per cent in West Africa. There are currently four countries in Africa that are publishing remittance data broken down by corridor; these are Ethiopia, Kenya, Morocco and Senegal.\n\nIn Benin, for example, among Togolese immigrants women are twice as numerous as men. Remittances sent from the top ECOWAS countries (Benin, Burkina Faso, Côte d'Ivoire, Guinea, Liberia, Mali, Niger, and Togo) exceed those sent from the top OECD countries.\n\nAs of October 2020, over 1 million people were internally displaced in Cameroon due to crises in the Lake Chad Basin area and the North-West South-West regions. Burkina Faso migrants have destinations including countries in Africa such as Angola, Algeria, Benin, Cameroon, Congo Brazzaville, The Gambia, Guinea Conakry, Niger, Nigeria, and Togo.\n\nRemittance transfers sometimes exceed Official Development Aid (ODA) and Foreign Direct Investment (FDI) in some parts of the World such as Sub-Saharan Africa, demonstrating their importance for promoting socio-economic development.\n\nThe AfCFTA Protocol on Digital Trade and cross-border payment systems like Pan-African Payment and Settlement System (PAPSS) offer a framework for harmonising rules, lowering costs and expanding formal remittance corridors.\n\n---\n\n## DOCUMENT 40: ETHIOPIA REMITTANCES DIASPORA GULF STATES\n\n**SOURCE_URL:** https://kflip.info/2023/02/09/overview-of-ethiopias-remittance-market/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Diaspora/Gulf States\n**REGION:** Ethiopia\n**CERTAINTY:** High\n\n**CONTENT:**\nEthiopia's latest remittance value from 2023 is 539.36 million U.S. dollars, an increase from 510.2 million U.S. dollars in 2022. Remittance flows to Sub-Saharan Africa are expected to have increased by about 1.9% in 2023 to $54 billion, driven by strong remittance growth in Mozambique (48.5%), Rwanda (16.8%), and Ethiopia (16%).\n\nEthiopia has a sizable diaspora community, with some estimates putting the figure at over 870,000. Other sources estimate that approximately 2.5 million Ethiopians live in North America, Europe, the Middle East, Australia, and Africa.\n\nApproximately 2.5 million sub-Saharan African immigrants lived in the United States in 2024—more than triple the number in 2000—with most coming from Nigeria, Ethiopia, Ghana, Kenya, or South Africa.\n\nDespite data discrepancies between sources, both the National Bank of Ethiopia and World Bank data show that the United States and Saudi Arabia are among Ethiopia's top five send markets.\n\nIt is estimated that 60-70 per cent of migrants travelling to Gulf States are undocumented, and this figure may be greater for migrants travelling to Southern Africa.\n\nThe Ethiopian government has sought to support the Ethiopian diaspora in the Middle East, who are mostly migrant labourers. After an initial ban on Ethiopian migration to Gulf States in 2013, following large-scale deportations of undocumented Ethiopian migrants from Saudi Arabia, the government introduced the Ethiopian Overseas Employment Proclamation No.923/2016 which specifies that migrants may only travel to work in countries where Ethiopia has concluded a bilateral labour agreement, such as Saudi Arabia, Qatar, and Jordan.\n\nEthiopian diaspora in Gulf states have limited rights as labour migrants, giving the diaspora a limited voice.\n\nThe High Level Diaspora Diplomacy Consultative Forum was established in January 2024. This Consultative Forum comprises 300 members from 25 countries and is expected to engage the diaspora in diplomatic efforts and strengthen their active participation in overall development efforts.\n\nIn 2024, according to the World Bank, over $96.4 billion flowed into Africa in remittances, which is approximately twice the level of overseas development assistance. Remittances provide a lifeline for many families and countries, especially in rural areas where they can make the biggest difference.\n\nEthiopia is one of only four countries in Africa (along with Kenya, Morocco, and Senegal) that publish remittance data broken down by corridor.\n\n---\n\n## DOCUMENT 41: SOUTH AFRICA REMITTANCE MARKET DYNAMICS\n\n**SOURCE_URL:** https://www.resbank.co.za/content/dam/sarb/what-we-do/payments-and-settlements/cross-border-payments-conference/documents/paper-migration-cross-border-payments.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Remittances/Regional Hub\n**REGION:** Southern Africa (South Africa)\n**CERTAINTY:** High\n\n**CONTENT:**\nApproximately one-fifth of total remittances to Africa stems from transfers within Africa. In 2023, this accounted for about US$20 billion of remittances originating from within Africa.\n\nThe South Africa to Zimbabwe corridor has emerged as the largest inbound remittance route in the Southern African Development Community (SADC) region. Zimbabwean migrants record the highest share of those remitting, at 59%, which stands noticeably above the SADC average of 56%.\n\nThe data also indicate that Zimbabweans (49%) are more likely to send funds once a month.\n"
}