{
  "id": "94df9e64fb1d44c1b54f045fb72f384adb9819d7",
  "source_url": "if://research/migration-remittances/2025-12-03/part-2",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:45.119164+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 2
  },
  "content": "Ghana, Côte d'Ivoire, and Nigeria are documented and perceived to have had major fisheries-driven human migrations in the sub-region. For a long time and up until the early 1980s, fishers used to migrate to the Gambia, Guinea-Bissau and Guinea to fish during the dry season (January-June) and return to Senegal for the rainy season to work in the fields.\n\nFishers based in Libreville moved seasonally (July–August–September) towards the northern part of the coast to fish bonga (Ethmalosa fimbriata). These seasonal movements were generally motivated by a wish to avoid management regulations according to which the bonga fishery around Libreville was closed during this period.\n\nMale fishers in Ghana's small-scale fisheries sector typically move between fishing communities to perform offshore fishing activities. In contrast, women often perform near-shore fishing activities, engaging in fish processing, financing fishing expeditions, and managing trade networks. Fisheries driven migration is male-dominated and it has a clear gender-labour division in the sub-region.\n\nMigrant fishers are known to impact the economic status of the host communities through the provision of jobs to the youths as well as sharing their catch with the locals. However, migrant fishers sometimes engage in confrontations with the locals of the host communities with varying degrees of violence.\n\n---\n\n## DOCUMENT 8: FULANI AND MAASAI PASTORAL COMMUNITIES SEASONAL MIGRATION\n\n**SOURCE_URL:** https://www.jstor.org/stable/2843971\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Seasonal/Pastoral Communities\n**REGION:** West Africa (Fulani), East Africa (Maasai)\n**CERTAINTY:** High\n\n**CONTENT:**\nThe Fulani people of West Africa demonstrate horizontal transhumance, moving their cattle herds between dry season grazing areas near water sources and wet season pastures in areas that become inaccessible during rains. Pastoralists' cattle in the past could graze freely on vast and safe rangelands. During the wet season, pastoralists returned to the northern savannah (Sudan savannah and semi-arid zone) to avoid the risk of tsetse-transmitted African animal trypanosomiasis.\n\nThe symbiotic relationship between farmers and herders in the post-harvest period consisted of cattle benefitting from crop residues in harvested fields and farmers deriving manure from dung deposited on their fields. Among Fulani in northern Burkina Faso, there are no 'pure agriculturalists' as everyone has at least some sheep or goats. However, those involved primarily in agricultural production are much more likely to leave than are pastoralists or agro-pastoralists.\n\nThe Maasai originated from the Nile Valley region and migrated southward over centuries, settling in the Great Rift Valley of Kenya and Tanzania. Their migration followed key ecological corridors that ensured access to water and pasture for their cattle. These ancient routes enabled the Maasai to avoid prolonged drought conditions by moving seasonally.\n\nMaasai pastoralists face numerous constraints that compel them to diversify their livelihoods and, at times, migrate without their livestock. A 2023 study of young Maasai men in the Amboseli region gathered information from 162 individuals who collectively undertook 445 migrations. The analysis revealed key geographic hubs (e.g., Nairobi region and coastal areas) and three distinct forms: (i) one-way migrations, (ii) direct return trips, and (iii) circular migration patterns.\n\nAlthough less frequent, remittances directed toward agricultural investment further underscore the growing role of farming in Maasai livelihoods. Notably, some migrants have used remittances to secure land titles, thereby linking migration with the broader struggle to maintain access to critical pastoral resources.\n\nStudies show that migration often aims to increase livestock holdings. The high proportion of migrants sending money for the purchase of animals, veterinary products, and the hiring of herders underscores their continued attachment to both the land they left and to livestock-based livelihoods. Migration in Maasai communities is becoming a cultural norm and not only a response to economic conditions.\n\nMigration both positively and negatively influenced households' resilience. Remittances from migrants enhanced households' economic capital (notably livestock and agriculture), cultural capital such as food and health support, various household equipment and the improvement of formal education and skills.\n\n---\n\n## DOCUMENT 9: AGRICULTURAL SEASONAL MIGRATION AFRICA\n\n**SOURCE_URL:** https://link.springer.com/article/10.1007/s10460-025-10716-1\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Seasonal/Agricultural Labor\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nMigration in Africa is mostly intra-regional; a primarily cross-border seasonal movement of laborers from contiguous areas during harvest time. Intra-African migration mainly happens for economic reasons, with people mostly moving in search of work in the informal sector. Both long-term and seasonal labour migrants regularly moved from landlocked countries in the Sahel to the coastal zones in Ghana, Côte d'Ivoire and Senegal that were home to significant cash crop production.\n\nThe Ethiopia-Sudan borderlands have long been a hub of capitalist production of lucrative agricultural commodities such as sesame that profoundly shape the political economy of these borderlands. Cross-border seasonal migrant labour is central to this capitalist commodity production.\n\nSeasonal migrant labourers often move between commercial farms, with a considerable number also moving to Sudan seeking work on commercial farms, especially in the neighbouring Gedaref state, where they mainly engage in weeding and harvesting sesame, cotton and sorghum. They migrate to Metema and Humera in April-July, returning to their villages in September. They leave again in November for the harvesting season, returning to their villages between January and February.\n\nEven if labor migration from rural to urban areas causes a labor shortage during peak seasons, remittances assist migrant-sending households in alleviating credit constraints in agricultural production, allowing the migrant-sending households to purchase agricultural inputs and absorb any risk eventualities in production.\n\nRemittances are mostly used for consumption, such as food and clothing, as well as to purchase agricultural inputs such as seeds, fertilizer, livestock, hired labor, and rent land. While remittances contribute to improved household incomes, education, and healthcare, migration also leads to demographic shifts, labour shortages, dependency on external income, and disruptions to traditional social cohesion.\n\nWestern African countries received 27 billion USD in remittances in 2020. Nigeria, the largest recipient in Sub-Saharan Africa in absolute terms, received nearly 64 per cent of this total (17.2 billion), while the Gambia (15.6 per cent) and Cabo Verde (13.9 per cent) received the most remittances as a share of GDP.\n\nClimate change has led to a 34-percent reduction in agricultural productivity growth in sub-Saharan Africa since 1961, which is further contributing to unprecedented food insecurity on the continent. Climate change is predicted to be the driver of up to 10 percent of all African cross-border migration by mid-century.\n\n---\n\n## DOCUMENT 10: AFRICA TO EUROPE MIGRATION CORRIDORS\n\n**SOURCE_URL:** https://publications.jrc.ec.europa.eu/repository/bitstream/JRC123516/jrc123516_remittances_in_north_africa_04_02_2021_final.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Africa to Global/Diaspora\n**REGION:** North Africa to Europe (France, UK, Italy)\n**CERTAINTY:** High\n\n**CONTENT:**\nThe main migration corridors for North Africa include Egypt–Saudi Arabia, Algeria–France, Egypt–Jordan, Morocco–France, Morocco–Spain, Morocco–Italy, and Egypt–Libya. Since the 1960s, the main source countries of migration from Africa to Europe have been Morocco, Algeria, Tunisia and to a lesser extent, Egypt. This has resulted in large diasporas with origins in these countries by the end of the 20th century.\n\nMuch of this migration was from the Maghreb to France, the Netherlands, Belgium and Germany. From the second half of the 1980s, the destination countries for migrants from the Maghreb broadened to include Spain and Italy, as a result of increased demand for low-skilled labour in those countries.\n\nThe MAFE (Migration between Africa and Europe) project focused on migration flows between Europe, namely Belgium, France, Italy, the Netherlands, Spain and the United Kingdom (UK) and Senegal, the Democratic Republic of Congo (DR Congo) and Ghana, which together account for over a quarter of all African migration to the EU.\n\nAbout half of African migrants in Europe are of North African origin, mostly residing in France, Italy, Belgium, Spain and the Netherlands, while the other half are of Sub-Saharan African origin, present throughout Western Europe, with significant concentrations in Belgium, France, Italy, the Netherlands, Portugal, Spain and the United Kingdom.\n\nThe Nigerian diaspora, concentrated primarily in the United States and United Kingdom, sent $19.8 billion back in 2024. Morocco rounded out the top three with $12 billion in inflows. Morocco, benefiting from its proximity to Europe, receives remittances primarily from France, Spain, and Italy, reflecting its strong diaspora presence in these countries.\n\nOver 70% of Morocco's remittances came from EU countries, mainly France, Spain and Italy, although it also receives remittances from Belgium, Germany and the Netherlands. Moroccan external flows are highly reliant on international remittances from France, which provided 36% of Morocco's international remittances in 2019.\n\nSeveral corridors from EU Member States, such as France to Algeria or Tunisia, and Italy to Morocco or Tunisia, have high costs despite large migrant stocks and a wide range of service providers.\n\nIrregular migration from West and Central Africa often occurs along the central Mediterranean route (sea crossings from North African countries and the Middle East mainly to Italy); the western Mediterranean route (consisting of several subroutes linking Morocco and Algeria to Spain); and the west African Atlantic route (from West African coastal countries and Morocco to the Canary Islands in Spain).\n\nRemittances are a lifeline sent by migrants to their families and communities back home. They lift the recipients out of poverty and pay for food, education and health care. The African diaspora should be seen as a potential resource rather than as a concern: a potential human and social capital that can make a major contribution to the political and institutional development of home countries of origin.\n\n---\n\n## DOCUMENT 11: AFRICA TO GULF STATES MIGRATION CORRIDORS\n\n**SOURCE_URL:** https://comparativemigrationstudies.springeropen.com/articles/10.1186/s40878-024-00390-3\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Africa to Global/Labor Migration\n**REGION:** Sub-Saharan Africa to GCC (UAE, Saudi Arabia, Qatar)\n**CERTAINTY:** High\n\n**CONTENT:**\nThere is a surge in migration of workers from Sub-Saharan Africa (SSA) to the Gulf Cooperation Council (GCC) nations, including Saudi Arabia, the United Arab Emirates (UAE), Oman, Kuwait, Qatar, and Bahrain. This is driven by GCC nations' efforts to diversify their economies beyond oil, while Sub-Saharan Africa faces a demographic explosion with many young people entering the job market.\n\nIn 2023, total remittance flows from the GCC to SSA reached $28.3 billion, with most outflows coming from Saudi Arabia ($12.5 billion), the UAE ($8.2 billion), and Qatar ($3.7 billion). The GCC countries are significant contributors to remittance flows to Sub-Saharan Africa, with major recipients including Ethiopia, Kenya, Nigeria, Ghana, Uganda, Tanzania, and Rwanda.\n\nAccording to a Gulf Labor Markets and Migration factsheet, in Saudi Arabia, the 2022 census recorded 715,000 nationals from Sub-Saharan African countries, representing 5.3 percent of the Kingdom's total foreign population.\n\nUnlike other nationality groups from Arab and Asian countries, Sub-Saharan African migrants in the GCC are mostly women, with Ethiopia as a key source of migrants, most notably to Saudi Arabia.\n\nThe top source of expatriates across the GCC countries is India. Out of the top ten migration corridors in the world, the India–UAE and India–Saudi Arabia corridors rank fourth and ninth. Other common source countries include Egypt (with the Egypt–Saudi Arabia migration corridor ranked tenth), Pakistan, Philippines, Jordan, Sri Lanka, and Bangladesh.\n\nIn 2019, there were 35 million foreign workers in the Gulf region, corresponding to approximately 21 percent of global figures. The number of remittances sent by foreign workers in the Gulf region to their countries through official channels is around $100 billion, with Saudi Arabia and the UAE among the top three countries globally for remittance outflows.\n\nLabor migration relative to total population averages around 50 percent across the GCC countries. The UAE and Qatar have led in hosting international labor migrants relative to their population, with Oman and Saudi Arabia maintaining a more measured approach.\n\nLong-term and permanent residency schemes were launched in Qatar and the UAE in 2018. UAE Cabinet Resolution 56 of 2018 grants \"golden visas\" valid for five or ten years to investors, entrepreneurs, and specialized talents. Saudi Arabia in 2019 introduced the sponsor-free Premium Residency scheme, offering permanent legal residence for 800,000 riyals (approximately $213,000).\n\n---\n\n## DOCUMENT 12: AFRICA TO UNITED STATES DIASPORA REMITTANCES\n\n**SOURCE_URL:** https://www.migrationpolicy.org/article/sub-saharan-african-immigrants-united-states-2025\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Africa to Global/Diaspora\n**REGION:** Africa to USA\n**CERTAINTY:** High\n\n**CONTENT:**\nApproximately 2.5 million sub-Saharan African immigrants lived in the United States in 2024—more than triple the number in 2000—with most coming from Nigeria, Ethiopia, Ghana, Kenya, or South Africa.\n\nThe Nigerian diaspora is the largest from the region, with close to 905,000 members, followed by the 412,000 U.S. residents who have links to Ethiopia and 332,000 with ties to Ghana. The United States has many African immigrants from Nigeria, Ghana, Ethiopia, and Kenya. These groups are well-established and have strong ties to their home countries, which fuel the flow of remittances.\n\nMigrants and other individuals worldwide sent approximately $54.3 billion in remittances via formal channels to sub-Saharan African countries in 2024, an 80 percent increase since 2010.\n"
}