{
  "id": "9da7f786b689f30eba08f827b614c29bff841004",
  "source_url": "if://research/migration-remittances/2025-12-03/part-7",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:46.859880+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 7
  },
  "content": "**REGION:** West Africa (Senegal, Mali, Guinea)\n**CERTAINTY:** High\n\n**CONTENT:**\nLabour migration in West Africa takes many forms, including temporary, seasonal and permanent migration, and implicates many sectors of employment, such as mining in Guinea, Burkina Faso, Mali and Senegal. Every year, thousands of seasonal workers from West and Central Africa travel to gold mining areas in Burkina Faso, Senegal or Mali.\n\nCôte d'Ivoire hosts more than 8 million migrants from Burkina Faso, 402,000 from Mali, and 112,000 from Guinea.\n\nBased on the 2000 Census Round Data, the number of Malians abroad was estimated to be in excess of 1.5 million, with 32% living and working in Côte d'Ivoire, 28% in Burkina Faso, 10% in Guinea, 6% in Nigeria and 5% in Ghana. Immigration to Mali is mostly regional, with migrants coming from Burkina Faso (23%), Ghana (13%), Guinea (10%), Benin (9%) and Niger (8%).\n\n84% of the estimated 100,000 mostly irregular migrants currently living in Mauritania come from neighbouring countries, particularly Senegal (38%) and Mali (28%) but also from Gambia, Côte d'Ivoire and Guinea-Bissau.\n\nWestern African countries received 27 billion USD in remittances in 2020. Nigeria, the largest recipient in Sub-Saharan Africa in absolute terms, received nearly 64% of this total (17.2 billion). Senegal's remittances received saw a record increase of 67% from 1.5 billion USD in 2010 to 2.5 billion USD in 2019. Regionwide, total remittances increased 43% between 2010 and 2019, from 23.6 billion USD to 33.7 billion.\n\nIn some cases remittances represent more than 7% of the country's GDP. In three countries, this percentage is much higher: Liberia (20.4%), The Gambia (15.4%), and Senegal (11.4%). For Mali, remittances reached 212 million USD in 2007, representing 3.3% of the country's GDP.\n\nRemittances sent from the top ECOWAS countries (Benin, Burkina Faso, Côte d'Ivoire, Guinea, Liberia, Mali, Niger, and Togo) exceed those sent from the top OECD countries. The highest remittance flows to the majority of the countries come from a West African country, although an OECD country is the top sending country in seven cases (Cape Verde, The Gambia, Ghana, Guinea-Bissau, Liberia, Nigeria, and Senegal).\n\nIn rural Mali, remittances responded positively to shocks suffered by recipient households. Surveys in the Senegal River Valley in Mali and in Senegal suggest that migration acts as an intrahousehold risk-diversification strategy, with remittances a contingent flow that supports family consumption in case of an adverse shock.\n\nMali was the leading country of origin for irregular migration to Europe in 2024, totaling roughly 16,500 people. In 2023, Guinea topped the list with approximately 21,700 individuals. ECOWAS enjoys freedom of movement for its documented citizens. As a result, an estimated 6 million people have moved within ECOWAS.\n\n---\n\n## DOCUMENT 33: SOMALIA DJIBOUTI REMITTANCES DIASPORA HAWALA\n\n**SOURCE_URL:** https://documents1.worldbank.org/curated/en/597711594118138283/pdf/Summary-of-Chapter-6-Remittances.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Diaspora/Informal Systems\n**REGION:** Somalia, Djibouti, Horn of Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nThe Somali diaspora includes two million people worldwide, keeping up strong economic and cultural links to Somalia. There are about two million Somalis living outside the country, mostly in African countries although most remittances come from diaspora living in Europe, the United States and Canada.\n\nSomalis primarily migrate to Kenya, Ethiopia, Yemen, Libya, UK, Djibouti, the U.S., and Sweden, in descending order. Before the 1990s, Somali migration had focused on the Arabian Peninsula and the Persian Gulf. Sweden has one of Europe's biggest Somali communities, with over 60,000 residents, mostly thanks to Sweden's generous refugee policies in the 1990s. The UK became a major destination because of colonial ties with British Somaliland.\n\nThe Somali diaspora sends between $1.4 billion and $2 billion in remittances annually to Somalia, supporting approximately half of all households in the country and preventing economic collapse. The Somali diaspora generates about $1.74 billion in annual remittances and makes up 15% of Somalia's GDP.\n\nThe financial support provided by Somali migrants is estimated at 1.4 billion USD remitted in 2018, which is equivalent to 25 percent of Somalia's GDP and outpaces international aid and foreign direct investment. 40% of Somali households rely on remittances to meet food security needs.\n\nAverage amount of international remittances received per household per year is US$ 743—above the average per capita income of Somalia of US$ 535 for 2017. Amount of remittances households receive varies from US$505 to US$876 for international remittances to US$138 to US$525 for domestic remittances.\n\nWith no official banks, remittances sent through a system called the hawala, the Arabic word for \"transfer,\" rose as an alternative. The hawala had begun in the 1970s when Somali migrant workers were trying to get around the country's foreign exchange controls. Migrant workers in the Middle East used the informal system to send money back home to families.\n\nFollowing the civil war, remittances flowed mainly through the hawala system. More than 20 MTOs operate in Somalia today, with the market dominated by three main players: Dahabshiil, Amal Express, and Taaj.\n\nDomestic remittances are conducted overwhelmingly through mobile money (46 percent), money transfer operators (47 percent), and informal channels such as hawala. International remittances are largely channeled through money transfer operators (87 percent) and mobile phone (12 percent). With weak formal banking systems, and a deep distrust of the local currency, mobile money use has surged. In 2017, the World Bank estimated that 73% of Somalis over the age of 16 use mobile money services.\n\nUp to 80% of starting capital for small and medium enterprises comes from the diaspora. Remittances have contributed to the growth of industries and services as diverse as real estate, transportation, imports of consumer goods, construction of hospitals and schools.\n\nCosts of remitting money to Somalia have increased. Since 2001, many countries have adopted stringent Anti-Money Laundering and Combatting the Financing of Terror (AML/CFT) regulations. Financial institutions have \"de-risked\" by terminating or restricting relationships with clients perceived as high risk. Several banks in Australia, the U.S., and UK have closed money services business accounts.\n\nThe traditional informal hawala networks – typically used by an older generation of Somalis – have been flagged by Western security services as a potential concern for money laundering and terrorism financing.\n\n---\n\n## DOCUMENT 34: UGANDA TANZANIA RWANDA MOBILE MONEY REMITTANCES\n\n**SOURCE_URL:** https://remitscope.org/africa/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Mobile Money/East Africa Corridor\n**REGION:** Uganda, Tanzania, Rwanda\n**CERTAINTY:** High\n\n**CONTENT:**\nEast Africa has been the traditional home of mobile money for over a decade, with Kenya achieving the top MobileRemit index score (97), and Rwanda (92) and Tanzania (90) also attaining high scores. In East Africa, countries like Kenya, Rwanda and Tanzania are leading by example in the adoption of mobile remittances, as reported by the MobileRemit Index prepared by IFAD.\n\nIn countries like Uganda and Tanzania, mobile money penetration exceeds 60% of the adult population, according to the World Bank's Global Findex Database.\n\nIn 2023, East Africa processed over 2 billion mobile money transactions monthly, with Kenya and Tanzania leading. The region's mobile money accounts grew from 160 million in 2018 to 300 million by 2023.\n\nIn Uganda, P2P transfers accounted for $28.6 billion in transaction value in 2023, a 29% increase from the previous year, according to the Bank of Uganda. Africa processed 65% of global mobile money transaction value last year, or $1.1 trillion. The continent also led in volume, accounting for nearly 82 billion of the 108 billion global transactions.\n\nM-Pesa has expanded its utility into cross-border remittances, enabling instant transfers to Uganda, Tanzania, and Rwanda. Globally, cross-border remittances via mobile money reached $34 billion in 2024.\n\nAt an average marginal cost of 61 percent, the Tanzania to Uganda corridor is the continent's most costly remittance corridor. Average remittance costs on the Rwanda-Kenya corridor have halved since data collection began in 2016. The lowest costs in this corridor are those of mobile money operator MTN at 4.03 percent.\n\nThe African remittance market remains the most expensive, with an average cost of 7.83 percent against the global average of 6 percent. Mobile transfer costs are already in line with the SDG target of 3 percent.\n\nIn Sub-Saharan Africa, mobile money's contribution to GDP rose from around $150 billion in 2022 to $190 billion in 2023. The industry helped boost GDP by more than 5% in about a dozen African countries, including Kenya, Rwanda, Uganda, and Tanzania. Kenya, Tanzania and Uganda top the global volume of mobile money transfers.\n\n---\n\n## DOCUMENT 35: INFORMAL REMITTANCES AFRICA STATISTICS\n\n**SOURCE_URL:** https://futures.issafrica.org/blog/2025/Rethinking-remittances-the-overlooked-billions-sustaining-African-households\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Informal Channels\n**REGION:** Pan-African\n**CERTAINTY:** Medium\n\n**CONTENT:**\nInformal remittances that are not systematically included in balance of payments can be significant in volume and can account for 35 to 75 per cent of formal remittances, particularly in the context of South-South corridors. Some analysts suggest that informal remittances could account for as much as 50% of the total amount sent through formal channels.\n\nSurveys of migrants and remittance recipients suggest that informal remittance flows could be equal to or exceed official figures for Sub-Saharan Africa.\n\nA substantial share of Africa's remittances move through informal channels, such as hand-carried cash or unregistered transfer systems, particularly in the Democratic Republic of the Congo, Libya, Zimbabwe, Somalia and Nigeria. Data from Uganda imply that a large share of remittances enter the country informally. This is consistent with the results on Sub-Saharan Africa from aggregate estimation, which support high informal flows to the region.\n\nInformal remittances are those sent through unlicensed or unregistered means. These flows have typically been cash-based—either in the form of cash physically carried across borders, sent with family and friends, cash given to bus or truck drivers crossing borders, or through unlicensed money transfer providers, including those using the hawala system.\n\nUnregistered M-PESA agents accept Ugandan Shillings from customers and top up wallets or send Kenyan Shillings on their behalf. For many senders using this method, they did not know that their preferred method is informal. The practice is not unlike the traditional hawala system, but with an updated digital approach.\n\nIn 2023, Africa received $100 billion in remittances, equaling nearly 6 per cent of the continent's GDP and exceeding Official Development Assistance (ODA) of $42 billion and Foreign Direct Investment (FDI) of $48 billion. In 2024, according to the World Bank, over $96.4 billion flowed into Africa in remittances, which is approximately twice the level of overseas development assistance.\n\nThe multiple guidelines governing acceptable forms of personal identification, maximum transaction sizes, licensing requirements for money-transfer operators, etc., combine to create a formal remittance market of such formidable complexity that it often drives customers to use simpler but riskier informal alternatives.\n\nIn Africa, many countries still practice various forms of currency control, resulting in a divergence between the parallel and the market exchange rate and a diversion of flows to informal, unrecorded channels. The average cost of sending money through mobile applications to Africa was around 5% of the amount transferred in 2023, far above the UN Sustainable Development Goal (SDG) target of 3% by 2030.\n\nThis reliance on unregistered intermediaries not only hampers efforts to promote financial inclusion and transparency but also obscures the true scale of diaspora support, limiting the effectiveness of evidence-based policymaking.\n\nDue to the largely unknown scope of informal transfers, some countries, particularly in sub-Saharan Africa, do not report remittances figures to the IMF in their balance of payments.\n\n---\n\n## DOCUMENT 36: BANK-BASED REMITTANCES AFRICA COMPETITION\n\n**SOURCE_URL:** https://www.un.org/osaa/news/reducing-remittance-costs-africa-path-resilient-financing-development\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Providers/Commercial Banks\n**REGION:** Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nWorld Bank research shows that banks remain the most expensive service providers on African remittance corridors. This is because banks tend to charge a flat fee which is usually a high percentage of the value of the remittance. Remittances are typically small sums, especially when compared to commercial transactions. Banks however have the advantage of a near universal presence which means that remittances do eventually get through, albeit at a higher cost.\n\nAccording to the World Bank, the average cost of sending $200 to Africa was 8.5 per cent of the amount transferred compared to less than 6 per cent globally in 2022. Sending money to some African countries, such as Angola, Botswana and Namibia, can sometimes cost as high as 20 per cent of the amount transferred.\n\nMost African countries restrict the payment of remittances to banks, which in turn, typically enter into exclusive arrangements with large money transfer companies, like Western Union or Money Gram, to operate on their behalf. The African remittance market is characterized by limited or lack of competition among the remittance service providers (RSPs). The major money transfer companies (Western Union and MoneyGram) control about 65% of all remittance payout locations.\n\nSince 2014, the ADLA license has allowed non-bank institutions to provide cross-border payment services, like remittances, with different levels of capital needed for each tier. This new system led to more competition and lower prices since its start.\n\nBankservAfrica has noted that \"By opening up the market to more players on an interoperable platform, this payment system enables both banks and non-banks (such as money transfer operators, or fintechs) to access regional cross border payment infrastructure.\"\n"
}