{
  "id": "fca4deae54329a336097dccd889e5708f7d881ad",
  "source_url": "if://research/migration-remittances/2025-12-03/part-5",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:46.231334+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 5
  },
  "content": "The cost of remittances is the highest in Sub-Saharan Africa and in the Pacific Island countries (for example, it costs more than 20 percent to send $200 from Australia to Vanuatu, and 19 percent from South Africa to Zambia).\n\nMigrant workers and their families need financial products which make it easier to send, receive and manage international money transfers, and to save and invest their income. Microfinance is well-suited for remittance-linked financial services, particularly among poor and geographically isolated populations.\n\nWith the recent increased popularity of microfinance, a number of microfinance institutions are looking into provision of remittance services. Some microfinance institutions are beginning to use the history of remittances as a way to evaluate creditworthiness of their poor customers who often cannot provide proof of income.\n\nThe ILO has developed financial education training tools and programmes and has carried out trainings in Benin, Burkina Faso, Ethiopia, Kenya, Mali, Mauritania, Morocco, and Senegal. The ILO has also carried out action research on migrant remittances and microfinance in various countries including Senegal and South Africa.\n\n---\n\n## DOCUMENT 23: SEASONAL LOAN PRODUCTS FOR MIGRANTS MFI\n\n**SOURCE_URL:** https://www.migrationpolicy.org/article/growing-linkages-between-migration-and-microfinance\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Credit Products\n**REGION:** Africa\n**CERTAINTY:** Medium\n\n**CONTENT:**\nIncreasingly, there are threads of discourse linking migration and microfinance. MFIs (sometimes with the support of development institutions) are targeting migrant households for a variety of microfinance services, including loan products. These organizations view microfinance institutions as ideal actors through which to empower migrant households.\n\nMigrants—and the potential remittances they represent—offer a lucrative new market. As a result, MFIs are now considering not only money-transfer services for migrants but also credit products specifically tailored for migrant households.\n\nAgriland Microfinance offers \"Agri-Kilimo Loans\" - seasonal financing tailored to meet farm investment needs, empowering farmers with microfinance, agricultural loans, and savings solutions across Kenya and East Africa.\n\nAdvans Tunisia has developed an individual loan called \"Crédit Saba\" enabling smallholder farmers to borrow up to 13,000€, with a flexible repayment plan adapted to the seasonality of their activities and their cash flows, as well as a grace period in case of an extreme climate event.\n\nAgricultural loans traditionally never exceed a period of ten months in Africa, and cooperatives are often forced to sell harvested produce immediately at the least profitable time to meet stringent input loan reimbursement deadlines.\n\nIn 2020, about 70,000 Ethiopian migrants were in Sudan. Two broad sets of movements dominate Ethiopian migration to Sudan, including agricultural work mobilizing thousands of seasonal workers intervening in commercial farms in eastern Sudan.\n\nThe F2.0 platform is streamlining agricultural finance in Sub-Saharan Africa via an online platform which connects MFIs to remote smallholder farmers and their cooperatives. While MFIs benefit from streamlined loan management and reduced risk, farmers can open a bank account and access financing to receive timely inputs.\n\nSympliFi has adjusted its loan product so that guarantors can choose how much they wish to put down as a refundable deposit. However, the product faced challenges from regulatory frameworks because it would hold deposits in sending countries (EU, UK) and then use those deposits as a loan guarantee in receiving countries like Senegal.\n\nThe funds sent home by migrant workers are a lifeline for rural families, helping to build resilience and support sustainable development.\n\n---\n\n## DOCUMENT 24: CROSS-BORDER CREDIT SCORING REMITTANCE DATA\n\n**SOURCE_URL:** https://techpoint.africa/insight/kredete-credit-scoring-for-immigrants/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Technology Solutions\n**REGION:** Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nKredete, a Nigerian fintech startup, uses remittance behaviour to create a verifiable transaction history that can be leveraged to create a credit profile for the user. The company recently announced raising $22 million in Series A funding from AfricInvest, Partech, and Polymorphic Capital, bringing its total funding to $24.75 million.\n\nKredete's platform enables users to build credit scores as they send money back home, bridging the gap between remittances and financial inclusion. Additionally, it offers a cross-border payment solution for businesses and recently launched a stablecoin-backed credit card that leverages blockchain technology for faster and more secure transactions.\n\nTransUnion is considering ways to incorporate cross-border transaction data into credit scoring models. Regular remittances sent or received could serve as credible proof of income and repayment reliability, enabling greater credit access.\n\nAfrican migrants send home close to $100 billion annually. According to the World Bank, remittances to Africa totalled over $92.2 billion in 2024, roughly twice the level of overseas development assistance.\n\nWithin Africa, 19 of the 54 countries rely on remittances for at least 4% of their GDP. Yet Africa remains the most expensive region in the world to send money to—in Q1 2024, the cost of sending $200 to sub-Saharan Africa averaged 8.4% compared to a global average of 6.4%.\n\nThere are questions about data quality: Can remittance data accurately produce predictive credit signals, and are cross-border flows enough to model borrower risk? The answer depends on the strength of local partnerships, low-cost acquisition channels, and robust alternative-data underwriting models.\n\nRising globalization has fuelled immigration, with migrants contributing significantly to the economic growth of their adopted country. Despite financial inclusion being in the spotlight, the migrant community faces severe challenges in accessing financial services, especially credit, due to the lack of a credit history.\n\nAs countries improve their digital payment systems and ecosystem and the financial inclusion of the population increases, people can swap to digital remittance services. Sending and receiving remittances is often the first interaction that people have with formal financial services and therefore can be a catalyst to drive financial inclusion.\n\nAfrica has leapfrogged traditional internet banking, widely adopting mobile money and digital wallets that offer faster, more affordable alternatives. Exemplified by Kenya's M-Pesa, these platforms facilitate rapid money transfers through mobile networks.\n\nWith a global credit score, financial institutions in any country can access and use immigrants' credit history from their home country. This would be a win-win situation for both banks and immigrants, allowing banks to tap into this largely underserved segment while promoting financial inclusion.\n\n---\n\n## DOCUMENT 25: INSURANCE FOR MIGRANT WORKERS AFRICA\n\n**SOURCE_URL:** https://publications.iom.int/system/files/pdf/Migrant-Welfare-Systems-Africa.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Insurance Products\n**REGION:** Africa\n**CERTAINTY:** Medium\n\n**CONTENT:**\nLump-sum payments provide limited protection compared to regular pension payments. From an African perspective, migrant workers often fail to qualify for benefits under contributory social insurance schemes, owing to shorter periods of employment and residence or because of their status as non-nationals. The lack of bilateral or multilateral agreements may prevent migrant workers from continuing to receive benefits when they move from one country to another.\n\nKenya is committed to ensuring that workers abroad enjoy strong protection and access to social security benefits. Through partnerships with key GCC countries, Kenya is embedding clear enforcement criteria and reviewing policies regularly to safeguard workers' rights.\n\nOman is paving the way for a new model for the entire region, having recently introduced legislation that gives migrant workers access to national social insurance coverage across multiple work and lifecycle risks. However, \"Social security contributions made in destination countries are rarely transferable to origin countries. A worker who spends years contributing abroad may return home without being able to access those benefits.\"\n\nRemittance-linked insurance products, although still facing many 'grey areas', have had some success at improving uptake, with examples including Fintech Inclusivity Solutions, AXA, Rise, HelloPaisa - Democrance, also allowing for bundling of insurance across different types of remittance services.\n\nRemittances provide a financial safety net for vulnerable households across Africa by enabling the diaspora to send money home. Investment is helping develop new business lines such as micro-insurance and data-analytics.\n\nDiaspora Insurance is a global insurance consultancy firm headquartered in Birmingham, United Kingdom, specializing in the designing, marketing and distribution of insurance products and risk management solutions targeted at expatriates and Diasporans. Their global insurance solutions enable diasporans to cover themselves abroad and also their families in their countries of origin.\n\nMutual Life Africa's Diaspora Life Cover offers a lump-sum payout in GBP, usable anywhere — for education, mortgages, healthcare, or daily living expenses — ensuring families remain financially protected and supported.\n\nIn 2023, remittance flows to low and middle-income countries reached $656 billion, surpassing foreign direct investment (FDI) and official development assistance (ODA). Among policy actions to leverage remittances for investment and development, channeling remittances through formal channels provides recipients with access to formal banking and financial products such as saving accounts, insurance, and credit facilities.\n\n---\n\n## DOCUMENT 26: MOBILE MONEY INTEROPERABILITY AND PAPSS\n\n**SOURCE_URL:** https://papss.com/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Technology Infrastructure\n**REGION:** Pan-African\n**CERTAINTY:** High\n\n**CONTENT:**\nPAPSS is revolutionizing intra-African trade by eliminating reliance on foreign currencies and reducing transaction costs. Launched to support the African Continental Free Trade Area (AfCFTA), PAPSS enables real-time, cost-effective transactions in local currencies, fostering financial autonomy and accelerating economic integration.\n\nBy early 2025, PAPSS had enabled real-time cross-border payments across 17 countries, connecting 14 national switches and over 150 commercial banks. As of August 2025, 18 African countries have joined the PAPSS network, connecting multiple regions across the continent through their central banks and numerous commercial banks.\n\nPAPSS supports three core processes: instant payment, pre-funding and net settlement. With instant payment, participants no longer need to convert local currencies into hard currencies which then entailed the funds leaving Africa to be converted before being sent back again. Compliance, legal and sanctions checks are performed instantly within the system, with near-instant payments processing within 120 seconds.\n\nPAPSS uses the ISO 20022 global message standard allowing interoperability, large data sets and rich data for payment and remittance information, with secure infrastructure incorporating cyber-security and payment fraud systems.\n\nPAPSS also promotes financial inclusion by enabling mobile money platforms to integrate with the system, offering cross-border payment solutions and extending financial services to underbanked populations.\n\nHowever, significant challenges remain: With over 171 mobile money options in Africa, most wallets (e.g., M-Pesa, MTN Mobile Money) operate in isolation. Even within one country, interoperability is rare, let alone across borders. PAPSS connects banks, but wallets lag behind due to proprietary systems and lack of open APIs. PAPSS connects banks, yet digital wallets—where much of Africa's financial activity actually occurs—remain poorly integrated.\n\nIntegrating PAPSS with existing national payment systems requires substantial technological and financial investments. Each country has its own payment infrastructure, regulatory frameworks, and operational standards. Some national systems may not yet support real-time payments or currency conversion, necessitating significant upgrades.\n\nRegulatory fragmentation exists, where each country has its own rules including KYC standards, data protection laws, and licensing requirements.\n\nRecent innovations, such as the integration of PAPSS into mobile banking apps for small and medium enterprises and diaspora remittance corridors, further democratize access to Africa's integrated financial future.\n\nThe regulation of domestic infrastructure, the introduction of national switches, and their integration are essential. Countries must connect national switches, such as Tanzania's TIPS and Rwanda's RSwitch, to PAPSS and standardize AML/KYC regulations to improve interoperable digital infrastructure and promote local currency settlement.\n\nThe PAPSS system enables cross-border payments in local currencies, reducing transaction costs. PSPs that integrate with PAPSS can capitalise on the growing demand for intra-African trade and cross-border remittances.\n\n---\n\n## DOCUMENT 27: BLOCKCHAIN DLT REMITTANCES AFRICA\n\n**SOURCE_URL:** https://www.tralac.org/publications/article/12938-distributed-ledger-technology-opportunities-for-africa-s-trade.html\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Opportunities/Technology Solutions\n**REGION:** Africa\n**CERTAINTY:** Medium\n\n**CONTENT:**\nCryptocurrencies have the potential to disrupt remittances in Africa, which many people rely on. Many exciting developments are occurring in the distributed ledger technology (DLT) and blockchain space in Africa, with much opportunity existing on the continent to leverage the benefits of blockchain in reducing costs, increasing efficiency, and ensuring trust and security in various applications.\n\nDLT enables peer-to-peer payments. Bitcoin's blockchain ledger records all BTC transfers immutably, used by millions for remittances (e.g., in El Salvador, where Bitcoin is legal tender).\n\nStablecoins are blockchain-based digital tokens pegged to a stable asset, such as the U.S. dollar. One of the best-known stablecoins, USDC, is issued by Circle, a regulated American company, and fully backed by dollar reserves and short-term treasuries.\n"
}