{
  "id": "ae60b01bcd254cba731278491a542a774ca105d1",
  "source_url": "if://research/migration-remittances/2025-12-03/part-1",
  "source_type": "market_research",
  "retrieved_at": "2025-12-03T19:33:44.647683+00:00",
  "metadata": {
    "research_type": "migration",
    "part": 1
  },
  "content": "# DEEP MIGRATORY WORKER PATTERNS & REMITTANCE CORRIDORS RESEARCH\n## Comprehensive Analysis of African Migration, Seasonal Workers, and Financial Service Opportunities\n\n**Research Date:** 2025-12-03\n**Total Documents:** 45+\n**Focus:** Africa Migration Patterns, Remittance Corridors, Financial Services\n\n---\n\n## DOCUMENT 1: WORLD BANK KNOMAD AFRICA REMITTANCE FLOWS 2024-2025\n\n**SOURCE_URL:** https://documents1.worldbank.org/curated/en/099714008132436612/pdf/IDU1a9cf73b51fcad1425a1a0dd1cc8f2f3331ce.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Global Overview\n**REGION:** Global/Africa\n**CERTAINTY:** High\n\n**CONTENT:**\nKNOMAD (Global Knowledge Partnership on Migration and Development) was active from 2013 until 2024, hosted by the World Bank and supported by the EU, Germany, Sweden, and Switzerland. During its existence, KNOMAD produced 40 migration and development briefs, 61 working papers, and numerous other policy briefs, many focused on remittance flows, trends, and challenges.\n\nAfter a period of strong growth during 2021-2022, officially recorded remittance flows to low- and middle-income countries (LMICs) moderated in 2023, reaching an estimated $656 billion. The modest 0.7% growth rate reflects large variances in regional growth, but remittances remained a crucial source of external finance for developing countries in 2023. Looking ahead, remittances to LMICs are expected to grow at a faster rate of 2.3% in 2024.\n\nSub-Saharan Africa continued to have the highest average remittance costs in Q4 2023, at about 7.9 per cent; East Asia and Pacific and South Asia had the lowest average remittance costs at 5.8 per cent.\n\nThe World Bank's Migration and Development Brief 40 (June 2024) includes detailed data on resource flows to Sub-Saharan Africa and the costs of sending remittances to African countries, which vary widely across corridors.\n\n---\n\n## DOCUMENT 2: SOUTH AFRICA TO SADC REMITTANCES MARKET ASSESSMENT 2024\n\n**SOURCE_URL:** https://www.resbank.co.za/content/dam/sarb/what-we-do/payments-and-settlements/cross-border-payments-conference/documents/paper-sa-sadc.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Intra-African\n**REGION:** Southern Africa (South Africa-SADC)\n**CERTAINTY:** High\n\n**CONTENT:**\nThe South Africa to Zimbabwe corridor has emerged as the largest inbound remittance route in the Southern African Development Community (SADC) region, with an average of over 3 million transactions and USD 296 million annually between 2016 and 2021.\n\nZimbabweans are the largest SADC migrants in South Africa, accounting for almost 50 percent of migrants (1.7 million of a total of 3.4 million SADC migrants) from the SADC region. According to IOM data from July 2024, the corridor recorded 32,309 movements, constituting 92% of all migration flows across Zimbabwe's official border points.\n\nThe South African corridor accounts for the highest level of remittances to Zimbabwe, with 43 percent in 2021, up from 38 percent in 2015. Zimbabwean migrants record the highest share of those remitting, at 59%, which stands noticeably above the SADC average of 56%. Approximately 49% of Zimbabweans send funds once a month.\n\nMozambique is ranked one of the top five countries that supply migrant labour to South Africa. According to the World Bank, Mozambique has enjoyed a steady increase in its remittances received from $93,372,690 in 2016 to $453,972,066 in 2021. As a percentage of GDP, remittance flow increased from 0.8% in 2016 to 2.8% in 2021 and dropped to 1.6% in 2022.\n\nAlmost half of SADC migrants are estimated to be Zimbabwean, with the next largest migrant populations coming from Malawi, Mozambique and Lesotho. Malawi and Mozambique have experienced a decline in formal remittance volumes in recent years. Malawian remittances in 2024 were 49% lower than their 2021 high, while Mozambican remittances have decreased by 36% since their high point in 2022. Malawi's decline in formal remittances is mostly driven by the country's currency crisis, creating discrepancies between official and black market exchange rates that steer remitters towards informal channels.\n\nThe estimated informal market size is around R3.4 billion, or around 17% of the size of the formal market. This is likely a substantial underestimate of the true size of the informal market. Discussions highlighted the use of 'grey' remittance channels that blend formal infrastructure with informal practices, particularly within the Mozambican corridor.\n\n---\n\n## DOCUMENT 3: BURKINA FASO - CÔTE D'IVOIRE MIGRATION CORRIDOR\n\n**SOURCE_URL:** https://www.mideq.org/en/migration-corridors/burkina-faso-cote-divoire/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Seasonal Migration\n**REGION:** West Africa (Burkina Faso-Côte d'Ivoire)\n**CERTAINTY:** High\n\n**CONTENT:**\nHosting 2.1 million intra-African migrants in 2017, with an annual immigration growth rate of between 1.8% and 4.4%, Côte d'Ivoire is the second most important destination for international migrants on the African continent after South Africa.\n\nIn 2017, a total of 1.3 million migrants used the corridors between Côte d'Ivoire and Burkina Faso, making it the second most important migration corridor in Africa and the number one destination for migrants within the West African region. In 2023, the Burkina Faso to Côte d'Ivoire migration corridor had the largest stock of migrants, namely 1,376,350, followed by Mali with 522,146 migrants.\n\nUnder French colonization and the Colonial Development Act of 1921, Burkina Faso became a main labor source for agricultural and factory work in Côte d'Ivoire. Conventions on migration were signed with Côte d'Ivoire (March 9, 1960), Mali (September 30, 1969), and Gabon (August 13, 1973) to provide security for Burkinabè migrants and to organize their remittances.\n\nEvery year, thousands of seasonal workers from West and Central Africa travel to gold mining areas in Burkina Faso, Senegal, or Mali. Nearly 90% of Burkinabè justify their migration to Côte d'Ivoire by the search for paid work and to help their families back home. Migration was part of a strategy to improve their social status and that of their entourage.\n\nAccording to the BCEAO, in 2011, Burkina Faso received 96.5 billion CFA francs in remittances from migrants, 31% of which came from Côte d'Ivoire. According to data from a 2018 survey, these remittances amounted to 81 billion CFA francs, 45% of which came from Côte d'Ivoire. In the 1990s, remittances made up about six percent of Burkina's GDP. Although one third of households in Burkina Faso receive remittances, it remains one of the world's poorest countries.\n\nIOM data indicates regional migration dropped by nearly 50 per cent during the first half of 2020 compared with 2019 due to government travel restrictions and COVID-19 impacts.\n\n---\n\n## DOCUMENT 4: NIGERIA MIGRATION CORRIDORS AND REMITTANCE FLOWS\n\n**SOURCE_URL:** https://www.un.org/osaa/sites/www.un.org.osaa/files/files/documents/2024/publications/23343_un_policypaper_remittanceswestafrica_v04.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Major Recipient\n**REGION:** West Africa (Nigeria)\n**CERTAINTY:** High\n\n**CONTENT:**\nNigeria deals with a range of migration issues, from massive internal and regional migration to brain drain and a large, well-educated diaspora in the West. The top destination countries for Nigerian emigrants include the United States, the United Kingdom, Ghana, Chad, Cameroon, Italy, Benin, Côte d'Ivoire, Spain, Sudan, and Niger.\n\nMany forcibly displaced Nigerians (approximately 333,411) are forced to become refugees in neighboring Cameroon, Niger, and Chad. As of October 2022, there were a total of 345,500 Nigerian refugees in Niger (187,136), Cameroon (138,107), and Chad (20,257). This displacement occurred after Boko Haram extended its insurgency to neighboring countries of the Lake Chad Basin.\n\nRemittance flows in 2022 in West Africa demonstrated a significant pattern and resilience, with Nigeria being the primary recipient of almost $21 billion, accounting for over 60 per cent of the subregion's inflows. Remittances to Nigeria, accounting for around 38% of total remittance inflows to the region, increased by 3.3% to $20.1 billion. In 2024, the Nigerian diaspora, concentrated primarily in the United States and United Kingdom, sent $19.8 billion back.\n\nRemittances originating from Africa to Nigeria account for 12.7% of total inflows, with the top six originating countries being Cameroon (23.4%), Ghana (17.2%), Togo (16.8%), South Africa (13.3%), Benin (8.6%) and Niger (5.6%).\n\nThe increase in remittance flows to the region supported the current accounts of several African countries dealing with food insecurity, supply chain disruptions, severe drought (Horn of Africa), floods (in Nigeria, Chad, Niger, Burkina Faso, Mali, and Cameroon), and debt-servicing difficulties.\n\n---\n\n## DOCUMENT 5: KENYA-TANZANIA EAST AFRICA MOBILE MONEY CORRIDOR\n\n**SOURCE_URL:** https://www.fsdkenya.org/blogs-publications/informal-remittance-is-still-common-in-east-africa-and-is-moving-with-the-times/\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Remittances/Mobile Money\n**REGION:** East Africa (Kenya-Tanzania)\n**CERTAINTY:** High\n\n**CONTENT:**\nEast Africa leads the continent in mobile money adoption, with over 60% of remittance transactions conducted digitally. In 2023, East Africa processed over 2 billion mobile money transactions monthly, with Kenya and Tanzania leading. Kenya's M-Pesa pioneers this with 96% of Kenyan households using mobile money. Kenya achieved the top remittance index score (97), nearby Rwanda (92), and the United Republic of Tanzania (90) also attaining high scores.\n\nThe cost of diaspora remittances from Tanzania to Kenya and Uganda was among the highest in Africa in the past year, averaging between 17 percent and 21 percent per $200. However, between Kenya and Tanzania, Ecobank charges 28.43 percent while the M-Pesa charge is only 5.86 percent (and Western Union only 4.14 percent).\n\nIn 2022, FSD Kenya commissioned research to explore the use of informal channels for remittances and low-value trade payments sent by MSMEs between Kenya and Tanzania (back-and-forth) and Kenya and Uganda. The main finding was that the preferred method of nearly 70% of senders was through formal channels, with the most popular channel being services offered by mobile money operators (e.g., sending money from Safaricom M-PESA to MTN in Uganda).\n\nResearch revealed a widespread practice of informal channels using digital means, where customers go to unregistered/unlicenced mobile money \"agents\" who provide cross-border money transfer services.\n\nThunes announced a new service corridor for users of M-Pesa Tanzania, enabling Tanzanians to seamlessly move money from their M-Pesa mobile wallets directly to any bank account in Kenya and Rwanda. A partnership between Access Holdings, Coronation Group, Safaricom, and M-PESA Africa will initially focus on pivotal markets including Nigeria, Kenya, Ghana, and Tanzania, with the goal of connecting more than 60 million customers and 5 million businesses across 8 countries.\n\nThe region's mobile money accounts grew from 160 million in 2018 to 300 million by 2023.\n\n---\n\n## DOCUMENT 6: DRC-ZAMBIA MINING CORRIDOR\n\n**SOURCE_URL:** https://www.wilsoncenter.org/blog-post/drc-mining-industry-child-labor-and-formalization-small-scale-mining\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Corridors/Mining Labor\n**REGION:** Central-Southern Africa (DRC-Zambia)\n**CERTAINTY:** Medium\n\n**CONTENT:**\nThe cobalt is often extracted from Artisanal and Small-scale mines (ASM) in the South-Eastern parts of the DRC, part of the mineral dense Copper Belt stretching across parts of DRC and Zambia. The Katanga copperbelt in the DRC is a belt about 70 kilometres wide and 250 kilometres long between Lubumbashi and Kolwezi. Together, the DRC and Zambian copper belts are the second largest global reserve of copper, about 1/3 the size of the Chilean reserve.\n\nMore than half of the world's cobalt resources are located in the DRC, and over 70% of the world's cobalt mining occurs there. Artisanal miners produce 20% of the country's cobalt output. The World Bank estimates that about 10 million people depend directly or indirectly on artisanal and small-scale mining (ASM) in sub-Saharan Africa.\n\nOf the 255,000 Congolese mining for cobalt, 40,000 are children, some as young as six years. Much of the work is informal small-scale mining in which laborers earn less than $2 per day.\n\nCross-border synergies enable mining companies to optimize container utilization by consolidating Zambian copper with DRC cobalt shipments. This operational efficiency reduces per-tonne transportation costs and improves competitiveness in international markets. There are six toll booths along the 400 km strategic route from Kolwezi, a major mining town, to Kasumbalesa on the border with Zambia.\n\nZambia maintains its position as Africa's second-largest copper producer, contributing approximately 3-4% of global copper output. The country's mining sector generates 70-75% of national export revenue. Most of this mining takes place in the Copperbelt, a large region covering much of the southern DRC and extending into northern Zambia. In this region, entire communities are often exposed to dangerous working conditions, toxic pollution and violence.\n\n---\n\n## DOCUMENT 7: WEST AFRICA GULF OF GUINEA FISHING COMMUNITIES MIGRATION\n\n**SOURCE_URL:** https://www.fao.org/4/i0448e/i0448e03.pdf\n**RETRIEVED:** 2025-12-03\n**CATEGORY:** Seasonal/Fishing Communities\n**REGION:** West Africa (Gulf of Guinea)\n**CERTAINTY:** High\n\n**CONTENT:**\nSeasonal or rural-rural migration are the main forms of migration exhibited by small-scale fishers in Ghana. Fisher migration is the movement of fishers to fishing grounds (or camps) away from home for any period ranging from few weeks to several months, mostly on a temporary basis and occasionally permanently. Most marine fishers do not limit their work to a single fishing community due to seasonal fish movements, tidal patterns, and economic opportunities.\n\nAdverse fishing water condition propels fishermen to migrate to countries with better fishing opportunities in the region. This is evident in the declining and seasonality of fisheries resources due to climate change and upsurge along the hotspots on West African coast, displacing fishing folks mainly from Ghana to Côte d'Ivoire and Nigeria. The migration lasts sometimes for up to 6 months.\n\nThe main cause of fishermen migrating from other West African countries to Nigeria is due to seasonal migration of commercial fish species and some of the migrants have permanently settled in the fishing communities.\n"
}